[
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Dibyangana Ganguly", "rating": 3, "content": "I have been using this app for 1 year. I had no complaints about it in the beginning. But now when I read a story which is ongoing it shows the writer uploaded new chapter in the list but when I click on that it shows the writer has not uploaded. And for this I have to uninstall the app again install it for getting the new chapters. Even after regularly updating the app it shows the same problem. Please look at this. It's my heartfelt request to you guys...Hope you'll solve this problem soon"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Sandriya Anciya", "rating": 5, "content": "Wattpad is really the best writing app I've tried so far. It was the first one I tried and I've looked for other apps like it too, but none are as good as this one. I like it a lot. But there are some glitches that i wish good be repaired. Sometimes when i try to upload pictures on my chapters, the pics either double up and or just disappears when I put them from my storage. Apart from all these, wattpad is really great👍🏻"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Shuktara Samkalpa", "rating": 4, "content": "I've used this app for more than 2 years now, and everything was great and I never had any complains. But now, since I've reinstalled it in my new device, the offline library capacity shows only uptill 2 books? Very disappointing, a horrible change from the previous 25 books. I really hope you'll look into this matter."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Amra Akber", "rating": 4, "content": "I have been using this app for few years. Its a great app. But recently i started facing an issue. I have added few of the stories to my offline list. But now, it shows only 2 offline stories in my library. When i add more stories to offline, it shows the list is full. I cant find the previously added stories anywhere in my library. Please help me with this problem."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "sakina hardwarewala", "rating": 4, "content": "I have been using this app for more than 4 years, but the new update for some odd reason has made the stories available offline have the last page of the chapter repeat itself before one can read the end. Please fix this issue cause it's damn weird and just a waste if time trying to figure it out."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Bunny", "rating": 4, "content": "I'm having problems with the paging mode whenever I reach the last page in a chapter of a book the last paragraph of the 2nd last page show's up and it's gotten quite irritating cause I have to re-check everytime if I'm reading the right paragraph or not, or sometimes I end up reading double. The overall app is good and I'm not facing any problems. Please fix this bug as soon as possible. Thank you"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Drishya Udayakumar", "rating": 5, "content": "This app is really amazing. I have installed a lot of apps to read stories but wattpad is the best one ever. It creates a very good platform for the people who are interested in writing. But I still miss those days when I was able to read stories without ads. Those days where a lot of books in my library where available to offline but now I cant(ofc yes for people with premium). But still this app is the best with various different genre stories. Over all this app is amazing. I love it."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Bangtabsonyeonshitforlifeu", "rating": 4, "content": "It's a really great app but it glitches a lot. For a few days, when I post an announcement or a comment, it says it has been 5 minutes since it posted but I only did it. And it glitches when I add a picture at the top and then the texts below it starts to glitch like 2-3 parahs crashed together. Other then that, I love this app. The reason why I gave it 4 stars is because of the glitches."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Riya Nirania", "rating": 3, "content": "Overall a good application for readers. But one thing I find irritating is the Reading mode reloads again and again and it changes the page I was currently reading .So I have to get back to that page again. It's very problematic and irritating when page formats change. Please resolve the issue."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Tishya Laskar", "rating": 3, "content": "The app is great and I've enjoyed my experience for the past year but the latest update is a bit problematic.. I like to have dark mode on all the time.. when I tap on a comment to see the replies, the original comment is completely white, only the emojis used and the user profile pic is visible... it's not that big of a problem but it's still inconvenient.. :\\"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Pragyamita Chaudhuri", "rating": 4, "content": "Honestly I love this app so much. It is the most exciting reading app ever but the only thing that a little bugs me is that sometimes when I am reading a story and forget to add in my library then there is a close possibility of not finding the story again. So I kind of wish there was check story history icon where I can check all the stories I have read before and add them to my Library or take a reference... Other than that I will say it once again I just totally love this app. ❤️❤️❤️"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Jace", "rating": 4, "content": "Absolutely Love this app, I've made so many friends and I love how simple it is to write on it! But recently, I was writing something, and it keeps freezing every time it tries to save or something, so I have to close out the app and go back in, and then it erases all my work. Also, once I use one font, it changes the whole text, then when I fix it, it changes it back! Please fix this when you can, I'll try restarting my phone, hopefully it fixes it if I do. Thank you!"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Mushy Avocados", "rating": 4, "content": "Lots of good stories of different genres and is also easy to use. Edit: I've been starting to have some problems with the app. Sometimes when I accidentally scroll down on the app and then it gives me an ad at the end of the story, that's fine but when i try to scroll back up it gives me another ad. I have to go out of the app and come back in for the ad to be gone. Also when the app last updated I tried to add another story to one of my reading lists, it shows that I have none."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Mephi", "rating": 1, "content": "I'm getting really tired of this app. I used to love reading the different stories on here before it got flooded with ads. I dealt with watching an ad after every two chapters, as annoying as it was. But now there are ads at the bottom of the screen while I'm reading, which completely breaks my immersion. I wouldnt complain if they were pop-ups that you could click off of, but they're stuck there with no chance of going away. I feel like Wattpad just doesn't care about it's users anymore."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Elena Bln", "rating": 2, "content": "The app has been really glitching lately. There are many stories that I can't access, even though they're in my library. I have to go to the author's profile and find the story again. Even if I remove them and then add them in my library again the problem isn't fixed. I can't move those specific stories either. They're constantly at the bottom of my library appearing as read stories, even though I haven't finished them.This has been going on for quite a while, so please do something to fix it!!"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Brooklyn Clarke", "rating": 3, "content": "Best reading app I've ever had until recently. It's doing this annoying thing when Im trying to add a story to a reading list but it's not giving me the option unless I close the app then reopen it, and even then if I don't add it quickly I have to start all over again. I have to do that whole process for EVERY story that I'm trying to add to or remove from a reading list. Please fix this problem 🙏"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Anum Jia", "rating": 1, "content": "I have always loved wattpad ever since I first found it. But now I can't search for anything because it keeps telling me that it's unable to establish a connection even when my wifi is functioning perfectly. I can't even access the homepage. The homepage comes up empty with a retry button, which does not do anything when you click on it. Please fix these issues because I would like to get the chance to read. Thanks"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Pediflor Burlat", "rating": 4, "content": "This app is really good, There are so many varieties of stories to choose from, and the stories are very interesting too, plus the controls are easy and simple. A lot of stories can be found here, from fanfiction, fantasy, LGBTQ+, Romance, Thriller, horror, .etc. However, I prefer no ads, every chapter I see a literal ad, however the app is Wonderful in every way. Thanks for making this app!"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Evie", "rating": 4, "content": "I absolutely love wattpad, it's nice to read when I'm bored or have no Internet (By downloading 2 books) but when I do have Internet and try to read there's ads after basically every chapter, and its incredibly frustrating, I don't mind an ad every 5 chapters or so but it gets boring and makes me loose interest in the book I'm reading when I get them continously. Great App though, I definitely recommend."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Wanna read with me? M.M.M", "rating": 4, "content": "It's not as bad as what other reviews make it seem to be. Sure, it's no longer unlimited, but the update is more convenient. The adds aren't too much either, just close your WiFi or data when you're reading, then turn it back on when you search for new stories. Paid stories are necessary for authors, it's to support them financially. It's optional and it ain't like they're forcing you to spend money to read their books. There are plenty other options. Just give it a go. Have fun :)))"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Elyna Ejiogu O.", "rating": 5, "content": "I honestly love this app. I can find any genre of books and widen my preferences and knowledge. I'm not very happy with the fact that I now have limited offline books but it's manageable. Also the fact that the ads are numerous and pop up every 2 chapters or so, it's really annoying. But other than that it a good app... I recommend it👍👍"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "XI IPA 6_Adinda Shaliha", "rating": 4, "content": "I like reading wattpad. Tbh, there are many ads. Even if it kind of disturbing, i don't really mind it. But the problem is, theres this 1 ad, i couldn't skip it, theres no X button, and it won't get closed. Its basically stayed and remain on the screen. And then, i had to close the app and lost my last search. Please do something"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Sophie Stubborn", "rating": 4, "content": "I love this app! Both read and write on it constantly. But, it keeps doing this thing where it takes my Reading Lists away. Like I'll try and add a new book and they aren't there. They are only there when I try to find one already added. Update: deleting and redownloading the app seems to fix it, make sure you remember your log in, drafts save"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Cassandra Garcia", "rating": 5, "content": "I absolutely love Wattpad I've had it since 2014 and I still am on it to this day, its easy to navigate and it gives great recommendations too. The only thing I wish they would do, is make it to were we are allowed to put the books into different folders in our library. My OCD gets really triggered because I can't have them separated by categories. I am happy I can at least sort them by either author, alphabetical, or when I added them. But it just bothers me that I can't create multi folders."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "szaffi", "rating": 4, "content": "perhaps the only problem i have is the amount of ridiculous ads. the only way to remove this factor is to pay (won't do) and to add the book to offline library and turn off the internet for no ads. there is also a problem with other websites (riddled with viruses sometimes) stealing works, novelhd is one example, and i would like wattpad to comprehend this and work on it. other than that, it's a nice place to share your works and connect with other writers."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "꧁ꋚꋚ_ꋪꏹꂡ ꋪꀤꁏꋖ_ꋚꋚ ꧂", "rating": 3, "content": "I've been using Wattpad for 3 years now and I didn't really have any problems until certain updates. When I try to read one of my book the app will glitch out and close completely. When I opened the app this morning it was telling me that only two stories were available offline. I tried restarting the app and even deleting it and installing it back but when I did that my screen would freeze. I talked to my friend about it and when she showed her her library it was the same as before."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "yogurtcoveredcat", "rating": 3, "content": "I've had this app for 3 years and hadn't had any problems, but over the years, the longer I've used it – the worse it's gotten. Every chapter you read you get ads and for some bizarre reason the books in my library restart the chapter I had originally been on. I am a new writer and everytime I am done writing and go to save it says there was 'a problem with my story'. I also can't copy - and - paste stuff from my own story; because when I do it say Wattpad stopped working? Still okay though <3."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "That One Weird Kid", "rating": 2, "content": "Very good app for reading. I enjoy it so much. Easy to navigate, save your favourite books, communicate with your readers/authors, and give your favorite authors support. My biggest issue now is that I'll be writing a chapter and the app will just crash, and delete the entire chapter. Even if it \"autosaves\" nope that chapter is gone have fun rewriting it now. Now I'm also having issues sorting my reading lists. It won't even let me edit them. Please fix it, so annoying."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Brotherhood Rejects", "rating": 4, "content": "It's okay. Though some different fonts, colored fonts, and indenting paragraphs would be nice. Just some ways for authors to be creative with their work. I have to create a Google Doc just to get strikethroughs. Also it would be nice if we could center a whole thing of text, instead of having to go line by line."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Celtakroth", "rating": 1, "content": "I'm usually not really bothered by apps, but the way they are implemented here is poor. For example, I tried swiping back up to go to the previous chapter (i.e. from chp 26 to 25) and it keeps playing an ad, and then when its over, it doesn't even take me back to chp 25, I'm still on 26. Even worse, no matter how many times I swipe up, it'll just keep repeating this. Actually atrocious. I think I'll stick to your website then this dumpster fire of an app."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Elune Shatterstone", "rating": 4, "content": "Ok, this app really does help developing writers, but my only request is that we could change the font when typing. Especially when writing, I need something other than Times New Roman, I prefer using Comic Sans, and I have friends that use other fonts. Also, the ability to change fonts in a chunk of text by selecting the text and having a font menu would be great!"},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Muhammad Baladewa", "rating": 4, "content": "Wattpad is a good platform for me both as a reader and a writer, the ui is easy to learn. Yet despite that I have my own gripes with it, for example the books I put in the offline section can't be read unless I already read a few chapters while I'm still online, that and the fact that medias like picture attached to the book is not included when we go offline and only shows as retry. The other thing is the absence of sort by vote, reads, etc. We only have the one where we get by selecting a tag."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Valeria Galvan", "rating": 3, "content": "i really really love this app but will all the updates i think it's gone down hill. also don't know if it's just me but sometimes pages will repeat themselves or words from a story will be cut off so i'll have to leave and reopen the story AT LEAST 2 or 3 times. I've reset my phone, logged out, even uninstalled the app and reinstalled it so many times i've lost count and the previous problems i've mentioned still haven't been fixed. i write on here myself and it hurts to give it three stars."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Miranousse Aristid", "rating": 4, "content": "I like this app. There are so many instresting stories to read. But there are a lot of adds. And after each chapter of a story there's an add at the end and its super annoying. I also notice that alot of stories are written in Spanish. So it would be nice if wattpad added a translater to the app. So you can translate the words in books that you don't understand. If that ends up happening then I'll give rate it five stars."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Geek4greek", "rating": 4, "content": "You know I absolutely love this app. I've had it for years. It's easy to use, it's fast, and it's great overall but I have two thing I would like to see updated. 1. The ads, I don't like being bombarded with ads after just reading one part of a story. Its just to much. 2. I would like to be able to see who is reading my stories and when they read it. I want to know who's reading them so I can tell what they like by their reading lists so I can change and make my stories appeal to them more."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Kristine Jane Parocha", "rating": 1, "content": "I really like reading in wattpad but now I dont like the new updated app because it isnt convenient to everybody. When you dont subscribe , There's a limit to story you can read offline and also the stories I love to read back then are not available now. Its not free. I hope that you can make the better app more convenient rather than this kind of situation. Thank you."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Gillian Chang", "rating": 3, "content": "I like this app, but there's two super annoying problems. First, pages don't load all the way, or they are cut off when reading. The only way to fix it is to restart the app. Second, editing or writing is god awful. I don't know if it's my phone or the app, but every time I'm trying to write, it sends me to the bottom of the draft when I'm trying to edit the middle of the draft. Using italics/underlining/bold is a nightmare because it sometimes changes the entire draft instead of one word."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Nathan Reitz", "rating": 3, "content": "App is okay, too difficult to search. Reading is fine, general browsing is fine. But if you want to search for something, it's so difficult. I want to be able to muti-tag search, then filter only completed works, then sort by reads, or favorites, or update date. You can sort of do it here or there but not in one big filter search. The search function seems to only work with titles, and when browsing I can't just combine a bunch of filters to find what I want. Too difficult to search."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Kübra Yoldas", "rating": 3, "content": "I use the app on a regular basis but recently it started to glitch weirdly. It shows a chapter count of like 32 when I have only 20 or something and it mixes them up and won't update when I put them back in their order. I don't know what the issue is :/ Issue still there and recently I haven't been able to upload any pictures either. Upsetting. This edit is a year later now... I'm also having trouble keeping the text in one font or on one side. It keeps glitching to the middle."},
{"app_name": "Wattpad - Read & Write Stories", "app_category": "Books & Reference", "app_installs": "4,523,079", "user_name": "Somi", "rating": 3, "content": "I've been using wattpad for a while now and had no issues. Now recently, after I logged out because of having issues with loading comments, home page, and publishing my books, it wouldn't let me log in again. I tried it with different wifi connections but still the same problem. Even tried deleting and reinstalling the app but still had the same problem. I can log in from the browser though. It's annoying to use it on there but for now I'll use the browser. It would be amazing if you fixed it."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Ryzel Jabinigay", "rating": 2, "content": "Where the hell did the 25 offline stories go? And it keeps saying \"can't connect to wattpad\" error. I'm at loss, i've been tolerating this app for years and i've loved it the way it is. And now there's only 2 available offline stories. I thought my account was the problem, i logged out and logged in again and it's still there. I also reinstalled it again and it's nothing. Nadah."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Gugulabazali Shaney Mahlo", "rating": 1, "content": "I used to love Wattpad so much but after the latest updates, I can't upload multiple images while writing my story, the writing and editing section takes forever to load so I have to use the long way to get to editing my books. I see ads even while reviewing my own book, why?? I understand ads on other people's stories but it's an unpleasant experience when you're busy trying to edit your books and enough of the unnecessary updates, it would be more customer friendly to fix bugs before that"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Spainviene Erous", "rating": 5, "content": "First of all, the app was great. Much like the original. The version I have is the one with 25 offline stories. And every time I update the app, it doesn't change, which is very nice since I read lots of stories at the same time. I actually have no problems except for the fact that sometimes, it won't load up. But that could be because of the internet connection."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "simba Khan", "rating": 1, "content": "I can't edit my own book which has lots of readers. Please handle the issues. I can't even put the complete checkmark there, you can clearly understand it. It flashes to a bright white screen and I am out from the edit page."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Akie Baltazar", "rating": 4, "content": "From unlimited to 25 then now 2 stories for offline. How can we read stories we are interested if there is only 2 slots for offline stories. It's great if you bring back the 25 slots of limitation for offline stories. But the app is good, I've been using Wattpad since I was in junior highschool until now."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Shree", "rating": 2, "content": "I really appreciated the 25 offline books in beta. But in recent update I am unable to keep it as such. Just two offline books are being allowed. I hope that it could be switched back to that."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Lina Kacia", "rating": 2, "content": "Please bring News Feed back!! It used to help me a lot in finding new books and new authors which now, is nearly impossible as wattpad can't always recommend me what I want to read and sometimes, only some famous books are discoverable through search engine and the ranking thing."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "the_gacha_girl_with_a_long_name", "rating": 1, "content": "I downloadef this version in hopes that it will work, as the previous one doesnt all, like; my wifi would be super strong, but the app said it cant connect to wattpad. Same story here. Help please!!"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Hsusandar linn", "rating": 2, "content": "I can't upload my story's new episode.everytime I upload,always appear \"close app\".I can't do anything.I am tried to open with another phone & still showing the same.pls fix that.I can't upload with that problem."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Iswat Folorunso", "rating": 3, "content": "This app was great but as soon as I updated it to the latest version, i started having problem with adding story to my library, couldn't read any new story"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "DY Darkia", "rating": 2, "content": "I have been Using Wattpad Beta for almost a Year now, And I really Like it. but soon after... The app is starting to show some glitch. And It also erase all my Download story's. I really Injoy it. I have been With wattpad since almost four years so please. just please. I want my wattpad back"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Elli Braisteanu", "rating": 3, "content": "Been using this app since 2017 and my problem is that since I came from the UK my earn coins videos won't load even if I restart my phone,uninstall-install the app,log out and even downloaded the beta version"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Wren Dunham", "rating": 2, "content": "Since the most recent update it doesn't hold the place of where I am in books. This is very l frustrating with fanfiction as some books have like 89 chapters."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "pre s", "rating": 5, "content": "This is the best app for listening to audiobooks in India. The collection is good, the price is cheap(if you compare it with other options) and the best part is there is no limit on number of books you can read in a month. They even keep adding new releases pretty frequently. My only suggestion is- Please give us a option to add books under our own categories. Because it confusing to find books when you read different genres."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Aj Cabrera", "rating": 2, "content": "Your update didn't allow me to sign in after I cleared data and updated the new version of this app."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Angela Nhicol Salalila", "rating": 4, "content": "This one have lesser ads than the original one cause I compared the two and the wattpad original have a lot of ads than this one but I like beta one"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Zoe Scarlet", "rating": 2, "content": "I had downloaded more than a hundred books, only for some of it to vanish. They lessened the number of books allowed to be read offline, from unlimited to 15. Fine, I can manage that, but it turned from 15 to 2 books. I don't know if there was an error, if so, please fix it. Please stop deleting the books I saved to be downloaded offline."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Sonder Crowley", "rating": 2, "content": "I used to love this app. Today, as I was reading a paid story that I paid for, I couldn't read any of the following chapters. It said I needed to log out and log back in. Now it won't let me in. It said I needed to reset my password, which I've never been asked to do previously. So I hit forget my password, and it says it sent to my yahoo email. But it hasn't shown up. I'm so angry because all I want to is read the book!"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Hollie Johnston", "rating": 4, "content": "I love it I haven't read an actual book in ages I mostly read Harry Potter fanfics or others similar /connected. The stories are a dream too read and I can't get enough absolutely love them especially the darker ones 😉😍🥵🖤"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Kayla Green", "rating": 1, "content": "I used to love this app until the update, the updates make zero sense, I'm currently contemplating on deleting this app and am also never going to recommend Wattpad to any one again."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Maria ulfa", "rating": 4, "content": "I love this app but sometimes it got too much add like every two chapters it got add. It very disturbing and quite annoying when you were very absorb in reading. At least give an add every one hour."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Olaniyan Fatiah", "rating": 2, "content": "The app was good before but now I can only add two books to my offline reading list. So frustrating"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Ellie Boatner", "rating": 3, "content": "I use to like this app alot but now when I try to log in again it says can't log in try again later(12) can you tell me what to do"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "melancholic.", "rating": 4, "content": "i have been using wattpad for almost three years now. all in all, it was great, my experience was great. but lately, after i accidentally clicked the log out button, the app won't allow me to open my account again. it always says \"unable to establish a secure connection,\" even though, i am using wifi. and tbh, it rlly annoys me. i don't know if the problem is in my side but i just hope it'll be fix asap. but again, the app was really great. keep it up, pals! 🐦"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "레이미다쿠", "rating": 1, "content": "The stories are not loading and before you ask me, my internet signal is strong (can even watch videos on other apps). Another thing is when I open the app, the screen keeps switching from pure black to pure white (or vice versa). I believe this bug/glitch started when you update the library. I just hope you can fix this problem ASAP, for I've been experiencing it for a while now and I can't stand it anymore. If you can't fix this fast, just bring back the old library, can you?"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "A Google user", "rating": 5, "content": "I love Wattpad. I've had an account for maybe 3 or 4 years? I recently made a new one though to separate fanfictions from real stories because it makes handling it all easier. My suggestion is that you create a link for multiple profiles. Say you have 2 accounts, you're logged into account 1 but you want to get into account 2 without having to deal with logging out and all that. It makes it so much easier to quickly switch from one to the other with a single press, like how Instagram does it. No one else can get to account 2 through your account 1 if you don't want them to, of course, so the option to switch accounts will be completely private, especially if they're under different emails."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Govind Jeyaram", "rating": 5, "content": "I completely moved out of Audible and using Storytel for over 3 years now. Without doubt, one of the best Audio books app that I had used. One suggestion - There should be a way to turn off or block books with adult content and profanity. Just like favorites list, you can have a blocklist to block genre, keywords, titles or authors from showing up in the recommendations and displaying in search. Kids mode only shows Kids story books and is not very useful."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Nisha Churi", "rating": 4, "content": "The app is good and the content is diverse too. However, I have given 4 stars as it needs following improvements: 1. The app should open the review window only when the review is not given. 2. It is irritating that the window for \"Recommended Titles\" opens when the story finishes. 3. The finished stories shouldn't keep reappearing on the home page 4. Vayam stories can be clubbed into a series 5. There should be a provision to sort books based on duration"},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Ajai Pisharady", "rating": 4, "content": "Good app for wear OS as audible is not supported. But two major issues: First it would be useful to have a control on moving the audio to a particular time. Currently the only option in watch is to keep tapping on 15sec button till you reach the time you intend. Secondly, if it seen that many times the book starts from beginning irrespective of where we left it earlier. This is pretty troublesome as it spoils the interest of the listener. Hope developer would consider these in next update"},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Amnas Ahamed", "rating": 5, "content": "I absolutely love stroytel, after reading mission and vision from your annual report i was amazed. I do have a suggestion though, i like to share striking parts of a book to my friends, while in audiobooks i miss those, if you can incorporate such a feature, it's appreciated. Even if you can't still going to stick on to listen your stories. 💜"},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Anand Patankar", "rating": 1, "content": "The app seems to have suspicious payment terms because it keeps asking me for debit card numbers. I got subscription confirmation receipt from Google Play Store, but the app still doesn't acknowledge my subscription. Already entered details of two debit cards, but still it wants more. Frustrated!!! Cancelled the subscription. Hoping to get the refund of subscription payment done 10 hours before now."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Moin Sk", "rating": 1, "content": "I am a longtime subscriber. The app got bad suddenly. I started getting an error saying 'Something went wrong' whenever I click on anything inside the app. Unable to listen to anything. The app became useless. Uninstall, install didn't help. Something seriously is wrong with this app. Will give back 5 starts once the issue is fixed."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "salazar grum", "rating": 1, "content": "Horrible app. Misleading ads for subscription. Ripping off Customers. I would give zero stars if that was possible. They are advertising a yearly subscription for 399. But are not mentioning anywhere that this actually does not contain any book that is actually worth reading. No English audiobook or ebooks are available in this subscription. And even for regional languages all the best books are tagged premium. Also, very slow app. Takes minutes to load a page. Horrible experience. Refund please"},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Shajira A", "rating": 5, "content": "Such a good app . It helped me to find a new way of learning through reading. I think its a best choice for those who loves to reads fiction,biographies , history or anything. There's also option to choose the type of book need and also we can change setting at any time ,can add name,photo and can select the languages. Superb Loved it 💖💖."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Senthil Ramesh", "rating": 2, "content": "I'm still in my trial period and I would have bought this for sure with the initial impression. But the following two points made me to not do it. 1. There is no chapter wise split. For example, I could be reading a book and then would want to switch to audio during commutes or other times when I cant read but listen. In such cases if I've to find the place where I need to start it's pretty difficult. You need to keep on forwarding and backward until you find the place which takes almost most of the time. 2. The app just can't preserve the last heard place. Whenever I stop listening and want to pick it at end of the day, the audio would be gone so long back. Knowing that I would just sometimes close the app as it would take forever to find the previous place as it doesn't even have chapters.. It's like a lengthy audio with no markings to find things. I'll buy if once these are fixed."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Avinash Hegde", "rating": 4, "content": "The collection is good but the app still has a few bugs with playback, and surprisingly so. For an app playing that's playing audio files, I'd think the team's first priority would be to get that right. Please fix it. Resuming playback either after a pause or after moving back a few steps fails, and I've just got to wait till the app feels like playing back again. 4 stars because I'm hopeful, and I like the business model, product pricing and collection."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Amythest Light", "rating": 5, "content": "I love this app! Yeah, there may be the occasional annoying glitch when writing, but I've used Wattpad for several years now. There are so many good books, and its great to read and write, chat with people and have fun! Though the update is weird to me. I liked the old logo better, and it has no indication that you posted an update or a new chapter, please put a button like before. (OR AT LEAST MAKE THEM VISIBLE) Also, whenever I go from my library to my private messages, it kicks from the app."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Adriana Rubio", "rating": 4, "content": "This is a very good app for writing and reading! I love it because it's pretty easy to start reading and writing. But some things aren't as good. Like sometimes we put videos in we want the music to continue for the whole chapter, but it stops after a couple of sentences. Also if there were more fonts to access when writing would be cool too! But other than that it's a great app!"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Mahreen Tanveer", "rating": 2, "content": "The app is great. has some amazing stories which are fun to read. However, from the past 2 weeks it has not been working. My notifications were not updating, I couldnt search stories..it told me that i didnt have a net connection but i did! I got fed up and uninstalled the app to see whether it works or not. i installed it again and now the app doesnt even let me log in or even sign up to make another id! It keeps on repeating that \"there was an error connecting to wp. plz try again later\". 😐😐"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "K D", "rating": 3, "content": "It's a good app for reading and there are many diverse books. The only problems are you must be online to read, only two books can be read offline unless you pay, there are ads every 10 minutes unless you pay to have them removed and for some reason when editing books, you can't copy and paste without the app crashing."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Saira Schwartz", "rating": 2, "content": "Wattpad and the Beta version used to be my go to guys. I was probably 11 when I downloaded the app for the very first time. I loved being able to read books online and offline, their weren't any ads and it was super easy to find new books and read what you wanted. I uninstalled the app about a year ago but I come back to find that they're are ads on every chapter, and you have to pay for books and you can only read 2 stories offline. I'm just not satisfied anymore."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Ilysa Serao", "rating": 3, "content": "I have used wattpad since I was 12 (I'm almost 20 now) and since there is no option like instagram or pinterest or something where you can have multiple accounts, I use this for one of them. It's great when I'm reading but lately the app has been crashing when I'm trying to write. It's very frustrating because half of the time, it deletes what I wrote. I tried updating it and deleting to reinstall and It still has issues."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Hillary Haze Yap", "rating": 2, "content": "It was good! Well when I first got it...but after a while..it started to glitch (?) every time I press it...and then it keeps on lagging, I write fanfics and when I try to publish a new chapter or re-write the said chapter it wouldn't let me, and when I search for a story it slows down it doesn't show any stories. I tried to write a message, it wouldn't let me"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "A Google user", "rating": 5, "content": "I love this app and have used it sor six years. I have been with many authors and watched books grow. I love this app it's the best. I enjoy the new books and the old ones as well. But recently the app will not allow me to select a ranked book. I can search the title and read it that way but if its ranked or at the bottom of the page of more like this I can not click an read. I did an update twice to see if that was the problem."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Anindita Biswas", "rating": 1, "content": "Absolutely unreliable app. I had imported a lot of books from my phone to this app and then deleted the original copies. When I logged out and in of the app - ALL the painstakingly collected books disappeared. I have used Play Books for years. The app is huge consequently, but I have NEVER lost books like this. Doesn't sync with old Kobo Touch either. Ridiculous!"},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Abhisek Chatterjee", "rating": 3, "content": "Everything is nice except the cost. I got 3 months premium for free and I thought I'd use these three months to explore the service and later will be a regular member. Audiobooks are clean, well read, there are many good and helpful features in the app. The main issue is the cost. Most of the audiobooks are more expensive than even the paperback versions. And keeping in mind that I have to spend that much money on top of the monthly subscription fee is a bit troublesome."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "AK Media", "rating": 4, "content": "Skymap functions outstanding. But here are some updates that I think Skymap should come in near future. 1. Please fix the gps calibration, 80% of the time, it doesn't show the real time calibration. This might be a problem with phones, m not sure. 2. I cannot find some recent discovered planets like Super Saturn or J1407B Apart from these, the app is outstanding and comes with rich information."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Prashant singh", "rating": 3, "content": "Overall this app is one of the best audiobook platform but it is lacking in few areas like it is quite difficult to resume an ongoing audiobook if you mistakenly go forward or backward . Secondly , there is no index in audiobook so you can not jump directly to any particular chapter. Still it is a very good platform as it is very affordable and wide range of books are available in many languages.."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Sulochana Giri", "rating": 5, "content": "Awesome! But it would be great if I can read and listen at the same time. There seems to be no facility like this.(either you have to read it or listen it). Also it would be benifited if I can directly go to the chapter especially in short stories. It is hectic to keep remembering exact time where one story end. This track becomes so much hectic for me."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "prathapsv genny", "rating": 1, "content": "Had very high expectations, but very much disappointed after not able to listen to any books.It worked fine for the first day and after that I just cannot listen to any books, when I click on listen, it automatically comes to end of the book and ask me rate my experience. How on earth that a developer and tester would miss this bug. It's again irritating to come and explain all this waste of time and energy."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Girish Duraisamy", "rating": 5, "content": "Ed: Looks like when playing the audiobooks on the tablet, I can't see options for variable speed, although your screenshots show the options. Looks like it may work only on phones. Please fix it. Update: Based on response from app developers, looks like the variable spped wont work for pre-Android 6. Using the app on iphone, windows 10 and other android devices. Great cross platform app. Hope they get more books."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Nishit Patel", "rating": 2, "content": "I have a 3 month trial and was very impressed with the collection of audiobooks available for the unlimited plan. I intended to buy a subscription once the trial was done. Unfortunately they pulled out a lot of good audiobooks in January. This is extremely disappointing because the ones that I'm interested in seem to be poor quality narrations."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Amol Ghanwat", "rating": 5, "content": "The best app to listen to Marathi and English audio books at a very affordable price. This is the only provider that has wide variety of Marathi audio books that I was not able to find anywhere else. I was only interested in Marathi books and recently Storytel added a subscription option for Marathi only content at even less monthly subscription price. That's really awesome. App is also good, never hanged or created any issues. New audio player is better than last one and I am sure the team would be improving the player further. Short stories are excellent and there are frequent new releases. These are really good if you want to have a quick fun read/listen and lighten your mood or learn something new quickly. Statistics section is also good to understand your listening habits. 5 Stars for providing us with such a good variety of audio books and podcasts. Few things that can make the app better 1- Support for web based player so that we can also use it on PC. 2- Pause the audio when there is a notification on mobile. The app currently keeps audio playing in background if there is a notification. Most of audio apps pause the audio and after the notification sound, resumes the audio 3- Increase library content for latest English audio books (there are review or summaries available for latest books but feel that there is lack of latest English content compared to other providers). 4- Separate section for podcasts and books. Right now podcasts are mixed with books which for me is bit confusing. I start listening thinking that it is a book and then realize that its actually a podcast 5- Maybe have a modern color and look for the app. Current app works great, but looks a bit outdated. Also add support for light and dark modes 6- If possible, add option to buy books so that we can keep them forever and can listen to them anytime later even if the subscription expires. Also, search feature needs improvements. If I search for something, usually there are no results. Every time I have to depend on the curated lists or book tips section to find something that I would like to listen."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Preksha Sharma", "rating": 5, "content": "I love the app & the variety of books. I do wish that you add even more wonderful books in here. Also, if you could make better tags to help find similar books, it'll be good. For eg, even fiction has different subgroups - so if you use tags more efficiently, it'll become easier for us to find books. Additionally, if there could be at least 2 options for audio because sometimes people are not comfortable with certain accents. Overall though, I love the app. Please introduce student discount!"},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Sudhakar GN", "rating": 4, "content": "Storytel Subsciption is awesome. Unlimited reading and decent collection. But the app is not great. Has usability issues and bugs. No clear exploring mode and reading mode. Often switching between books for playing resulted in wrong title. Preview is horrible. Could not figure out anything at all. Download is not reliable. They should just see audible and keep it simple and neat. Recommendations need improvements. I can support pre release testing or feedback."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Moneshwar Sharma", "rating": 1, "content": "I have been using the audible app (the other audio book app) for a very long time. So if I compare both the apps, I would say the most important feature is missing in your app i.e. indexing. we can not move to any specific chapter in an audio book. This is a must have feature for any audio book app. This is really helpful when we want to listen any specific chapter from an audio book which we have already listened before. I'll change my rating to 5 star once u add that feature."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Anusha Avadhani", "rating": 5, "content": "Great app. I have read a lot of books beacuse of storytel. It has amazing features like offline listening, controlling the speed, setting timer. And the best thing is you can try it for one month absolutely free.Some of my friends were hesitant to give credit card details while trying for free trial, i want to tell everyone it is completely safe. You will be charged only after 30 days.so please go ahead and read (listen) a lot!"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Kyzyl Tamayo", "rating": 1, "content": "I've been using this for a 5 or more months and I must say that it was good but I have a problem with it and it was so irritating there was a LOT of ads! can you just remove it?! We don't need them! In every chapter there were ads. Damn it! It was so damn irritating! Useless Ads. We don't need them in our life we're not enjoying it.. it wasn't satisfying it was dumb. Please! Remove them.."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Thisuri Seshanika", "rating": 1, "content": "This app was good but now I can add only 2 books to offline list."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "shan hayan", "rating": 1, "content": "I just downloaded it and I can't even log in ...ty Wattpad.."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "bribe me", "rating": 1, "content": "Most of it became all money and that's not a good sign. I'm a writer, and though a lot of the changes benefit writers, I think it's still an excessive change considering that not even the bugs or glitches are being fixed but you have to pay for it. Not everyone, or most of us can't cope with all of it. If there are no further considerations made in the future, it might (will) drive users away. Seriously, other paid reading platforms don't do this."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "ada jay", "rating": 2, "content": "This app gets worst after every update, I honestly don't like how you can have only how a person can only have two offline stories in your library unless you join wattpad premium. I also don't like how every other books in my library has to be read online, it's not all the time I'm connected to wifi because it sometimes stops working. I also find it very irritating how there are so many ads even though it's to help the writers."},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "Hardcore Remixer", "rating": 5, "content": "Great app! Just on little bug! I am on dark theme and I can't see the top comment in a comment section after I enter that section. It is just a white box or white text in a white box. I can see from outsite the comment section so it isn't a big deal. Again, great app!"},
{"app_name": "Wattpad Beta", "app_category": "Books & Reference", "app_installs": "123,035", "user_name": "moon -", "rating": 3, "content": "I really like wattpad when I first downloaded it and when I saw wattpad beta I thought It be that same but like idk, i just hate those ads thats literally in every page and right after too and other stuff like canceling some other book authors and stuff and most off all when I log out for just a day it would say like 'your log in is expired' and I can't log in again so I have to make a new password to just log in but I'll give it a 3 rn"},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "shashant more", "rating": 1, "content": "₹13,400 for a year! It's too costly. You will only use this app to animate a photograph or two. Also the animation is not flawless and you can see the burred ear or face stretching to side as the image moves. I tried 2 photographs out of which it have to recognized face and when it worked with the other one it asked me a whole lot money. This app is only for the rich and wealthy, I'm never coming back to this app."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Anant Krishnan", "rating": 4, "content": "Good App. Easier to buy & download than Kindle. Re-download of library is simple, fast & efficient. Store search & Library Search needs improvement. Reading books is good. However, shuffling pages, going back & froth in same book in different chapters is extremely bad design, as compared to Kindle or Google Books. There it's simple; here, it's a big pain. Didn't use any audio books here or in Kindle or Google Books. Find them too costly. Also, books in Kindle for same author & title is cheaper."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Yarielys Cortes", "rating": 3, "content": "I have only been able to read the begining of a book 📚. I love the start and am very excited to finish it 😄. To be honest though I wish that the app would show two pages at a time so it is faster and the reader doesn't have to be constantly turning one page 📄 after the other. Just being able to read two and then changing the page. That is my opinion on the app being better. But idk 😐."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Kevin Howard", "rating": 3, "content": "Generally ok, but there are two annoying problems. Accessing the notes within the text of a book is rediculously slow, I've timed it at 11 seconds in my current book. When accessing important sections of text that I've highlighted, in the annotations menu, I find it has created multiple duplications of the highlighted entries."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Threvi Vacal", "rating": 2, "content": "As an avid reader, this app was very promising to me as another source of awesome reads. However, the app is very laggy. It freezes most of the time on both my phone and tablet. There is also very limited customization options on reading format. For example, it does not have an option to indent paragraphs and add spaces to each line on the book you're reading, I think it adds to eye strain. Also, please do impose very strict proofreading and editing of the books available and sold in the app"},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Russell", "rating": 3, "content": "It has been a decent app so far but I have 2 issues: 1 in the latest book I'm reading it has 2 images side by side, one is landscape and the other is portrait. They both are put onto the same page and the second image is cut off towards the bottom which is shifted to the next page. Not a very pleasing visual experience. My other issue is that there appears to be no text justify option. Annoyingly the text of a new sentence always appears to be shifted towards the right and I cannot change it"},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Shy Ravindran", "rating": 3, "content": "I'm mostly reviewing this as an audiobook listener, not so much e-reader - it's generally a good app, I use it a lot! But it's just insane to me that there's no ability to bookmark audiobooks? I listen to them while I fall asleep, so it's nice to just have a bookmark to jump back to if i fall asleep quickly. Like I can extrapolate based on the sleep timer but... Bookmarking is so much easier. C'mon kobo, every other audiobook player has this feature 😕"},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Laurel K", "rating": 4, "content": "Good app, does what it says on the tin.. I can pull up and read my Indigo books. Have one tiny gripe, I wish I could change the line height (spacing) as I don't like the text to be large but it is much easier to read when the lines are further apart. Can do this on other ebook apps, would love to do it here. Otherwise five stars, never had an issue and still have all my books no matter what device I'm on."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Zuzanna Szabłowska", "rating": 3, "content": "Good selection, never encountered technical problems, and most importantly, buying here doesn't give money to Beff Jezos, so it's my go-to for ebook purchases. I can't give a higher rating, though, until the app allows for adjusting line spacing. The text in available presets is cramped so tight that I have trouble finishing a page, and in an app designed for reading, poor customization options are a huge drawback. Please let readers better adjust the text to their needs :("},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Jennifer Seifert", "rating": 3, "content": "I've been using the free part of the app for some time now. Still trying to figure out the navigation. I linked it to my kobo I got this Christmas and even after syncing my kobo it still doesn't save my place in my book. I just signed up for a subscription and the account information could be easier to find, for example finding how many points I have. I wish there was a way to rate books I've read outside of the app to better match new books to read."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Delta One", "rating": 2, "content": "Your international collection is abysmal... Many authors books/ series are missing, if by chance a series is available then 1 or more titles would be missing. so no point in getting them. Audible search engine needs improvement. Multiple filters cannot be applied at the same time. As soon as u apply 1 filter the filter menu closes. And when you are going through the search results if u open a book n go back the search window closes n u have to start all over again."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "The Frenchr", "rating": 3, "content": "I really do like the app, just wish they spent a little more on development. Navigating through to look at different books seems more difficult then it should be. For instance, when you look in one section and go a little deeper or into a particular book and try to go back, it takes you all the way back and have to restart. Also, I'm a little confused on the hole buying part. But as a prime member, I have lots to check out and get use to it all. End of the day, love this for my long drives."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Matthew Uhl", "rating": 2, "content": "The new user interface is terrible. It is no longer intuitive. Lots of information is missing. When books were published, ability to but the Kindle and add the audio, etc. They attempted to streamline it and stripped away essential items. I will continue to use it as I have a large library. But if you are just considering a platform I would not use audible based on this awful redesign."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Crazy Krumenackers", "rating": 2, "content": "They've changed recently. I'll still use it but far less. If a book was under my $15 month fee, I would go ahead and buy the book... ALSO have a credit toward another book. That is no longer an option. I have to use my \"credit\" from my fee. I think audible shot themselves in the foot with this one. Also my only option to buy more credits is for $40, I get 3 credits for that. I could see a scale of options with more being a bigger discount. 2nd foot shot. I won't buy more just 1 a month."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "tony", "rating": 1, "content": "I am compelled to find an alternative app. This app has only taken a turn for the worse over the last few months, culminating with this price gouging action they just implemented. Navigation increasingly grew more difficult and less helpful. Despite it's better aesthetics. The cost of everything has sky rocketed! Every book under a credit has had a price increase. Books ≈$20 have had a value impact. Audible was already a more expensive subscription service. Now, it's nearly unbearable."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Leanne Evans", "rating": 1, "content": "***Warning*** Just upgraded the app on 3/24/22. Don't do it! Audible has eliminated the ability to buy books on sale or to pay with a credit card with the app upgrade. All have to be purchased with a credit. Some audio books could be purchased on for 1.99 or were free if you owned the Kindle book. Now you have to pay with a credit which has a higher value. I'm so disappointed they have eliminated that choice and will be looking for other options for future audio purchases."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Anthony Young", "rating": 1, "content": "Fix the app. It's so frustrating to constantly need to reset filters when searching for a new book, only to find the filters gone. Once you've looked at a title and try to go back to the filtered list and place you were viewing, it's gone. Or if u look at a book series and go to back out, instead of going back to the previous section u were in, it throws you back 2 or 3 pages/selections. Seriously, how hard is it to go back one step/page at a time? Pretty basic expectation no?"},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Michael Breton", "rating": 1, "content": "Audible app use to be perfect, but they have slowly removed more and more features, making it nearly entirely useless. Basically, you need to purchase titles on the website and use the app to only listen to the titles. Even trying to find titles in your wish list is difficult. You get a free book every month, but you can't find it in the app. You can't even see best seller listings anymore. You can't purchase books anymore on the app. Utterly useless and completely unacceptable!"},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Alan Watkins", "rating": 2, "content": "This app used to be great. It was simple to use, easy to purchase new books, and couldn't have been much improved. But now (likely in an attempt to move people away from the play store) you can't browse the store properly, you can only pay for books with credits, can't partake in any sales... And even things like the sleep timer is now frustrating to use. Awful needless changes by amazon"},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Callan Pierson", "rating": 2, "content": "I find this app irritating to use. It is hard to just browse the selections. Once I finally found the \"see all\" categories, set my filters, and clicked on a book to possibly listen to, I found out when you hit the back button, it goes back to the main screen. So, everytime I wanted to see if there was a book I wanted to listen to, I had to reset my filters. Why it doesn't just go back to where you were is beyond me. I come from using Hoopla (free library app), which has a much better interface."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Tori-Parker Freyre", "rating": 2, "content": "I HATE this new update. I'd pay to undo it if I could. The layout changed. Things like the catalogue and wishlist are more difficult to get to or add to and you no longer have payment options or the ability to church the whisper sync for a cheaper price. This means even if a book is only $2 you'd still have to waste your credit if you want to get it in stead of saving it for something not expensive. In fact, it won't even let you SEE the prices on the app. I HATE it..."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Pinky Q", "rating": 2, "content": "Although the app is brilliant, the positions/locations aren't accurate. I can visibly, in naked eye see where the sun is positioned, but on your app it is during the sun in a different location/direction. If this is the scenario with Sun , then I imagine all other planets and stars location are also incorrect! This has to be corrected! Otherwise, I must say this is a brilliant initiative as an app!"},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Aaron Emberger", "rating": 3, "content": "When it works it is really great( better than any other app of the genre I've found) but sometimes it doesn't work. Oftentimes the time and location is very wrong even after manually putting in my cordanates and timezone. On most devices I've used this on it has automatically set itself up and been fine however. I rate this only 3 because having your location wrong is very inconvenient."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Stephen Winder", "rating": 5, "content": "Sky Map is excellent, a true revelation of the sky! Well done to all Devs. You have to make sure the compass is calibrated though to ensure accurate alignment. As well as the suggestions in the app, imagine rolling a ball around the screen to aid on the calibration (that's how my compass app does it anyway!). For me, the app always reports uncalibrated even when it is, although it reports accuracy as high. Could be my phone I guess? Anyway I love the app."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Julie", "rating": 5, "content": "I love this app. It does better on phones with a good magnetometer. You need to let it use your GPS coordinates in the settings and use magnetic correction. Tap the upper right corner of the phone to bring up settings and tap on location settings to tap on gps and magnetic correction. Also have your location on to use gps. Under settings learn to calibrate your phone. Tap the left side of the screen to add planets, stars, etc. Once set up, tap center of phone to begin. Use the app outdoors."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "nothingness", "rating": 4, "content": "Easy to use and a very simple app all around. Like the different FOV option (zoom in or out). Would like to see a real time Milky Way location so I can find it easily instead of using other apps."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Elizabeth Thompson", "rating": 4, "content": "finally a device with all sensors & this app works, but... appears to be 1hr behind, some error, but it gets you pointed in the general direction; search darkens the image too much; declination & right ascension grid would be nice instead of celestial."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Anthony Beck", "rating": 5, "content": "Love this, no ads, accurate depending on your device and calibration, will remain on my devices for as long as it is around. Recommended to anyone else interested in looking up and out of there own small lives."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Amanda", "rating": 5, "content": "Love it! There's a red filter that preserves night vision. Easy to search for specific features or identify a celestial object you see just by holding the phone up to it."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Sophie Cron", "rating": 1, "content": "The app is generally well designed, but is completely unusable as the image constantly shakes and jitters, even after calibrating the compass and holding it perfectly still. Please fix this bug ❤"},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Mary McKernan", "rating": 2, "content": "The image jitters, no matter that the phone is steady and not hand held. So this shuddering makes it impossible to read the words on the screen. If this doesn't change soon, I will have to uninstall as it's not fit for purpose. Two stars merely because it has potential so I'm hoping the developers can fix this issue."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Angel Guest", "rating": 2, "content": "I always have an issue with this. It never calibrates. I do what it tells me to do and it's never right. Update: I always calibrate it when it tells me it's low, it switches to high and still no luck. It does this on every phone I've used. Is it a location setting in my phone or something?"},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Cassidy Hansen", "rating": 5, "content": "Please add fast forward and reverse buttons without having to enter time and date (which should default to right now, btw). I often just want to see the way the sky will change from now until a few hours ahead."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Steve", "rating": 5, "content": "Wonderful. Our phone's sensors can be scrambled easily as a heads up, the window in my room causes the view to spaz out. Try it in different areas."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "vijay raghavan", "rating": 5, "content": "Simple no-nonsense app that does what it is expected to do. Loads quickly and is always accurate. Highly recommended. A suggestion to display comets and meter showers if possible."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Rohan Aggarwal", "rating": 4, "content": "A fairly good app. I selected this over other audio book apps because of no restrictions on number of book titles, and a reasonable price (a bit on the higher side). A couple of points where improvement is needed- book search, suggestions and other similar algorithms. Secondly, the app interface needs to improve. I was reading two books simultaneously. While I was able to save progress in one, I was unable to do so in the other. Overall, one of the better affordable apps around."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Siddhesh Ayre", "rating": 5, "content": "This is one of the best apps for audiobooks. They have a range of books from classics to contemporary. They even have content from Indian local languages. This is something I missed in Audible. There is still room for improvement in terms of app and it's UI. I hope they add more calibration for increasing reading speed. Edit - They have indeed added more calibration. Thank yoy Storytel."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Kumar Debadutta", "rating": 2, "content": "Large number of books--mostly from good publishers like penguin--have been removed, limiting its usefulness. Unless they bring back those, there is not much point in using it in place of Audible where most of the books you want will be available. The app is very buggy, too, and it is quite impossible to go backward for 1 minute or two as it will bring you back to the starting position."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Naveen N", "rating": 5, "content": "I recently switched from Audible to storytel app. The advantage with Audible is that they have a much larger collection of New books. But Audible has much higher cost of ownership for people who read more than 2 books each month. The return process is not simple and the real reason why many of us would like to switch books is not there. Storytel doesnt put a limit on the number of books you can read each month without paying more. That's a great feature."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Rishikesh Singh", "rating": 4, "content": "This has become my favorite app in no time. Fantastic collection of audio books and the unlimited option is certainly a game changer compared to Audible. The user experience needs lot of improvements though - UI doesn't show what % of the book is remaining. Another glaring miss is that the chapters titles do not show up which is unacceptable. Otherwise great value for money."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Christopher Praveen", "rating": 3, "content": "Needs a lot of improvements. The app is not stable. It acts up while browsing. I'm a subscriber myself but I would like to see more features like listening time monitor, more sharing features, cool badges and such things. Audible is more innovative in this regard. I like the cost, but there's more room for improvement."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Abhishek Sharma", "rating": 1, "content": "Just downloaded the app, I have 3 month subscription. Was looking for language preference setting. Found it in app settings. I tapped on show audiobooks and show ebooks button, now the switch to enable the audiobooks and ebooks has been disabled. And my dashboard shows me no results, since both the options are turned off. How do I reset it? and if I can't even reset it, what's the point of keeping the app?"},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Sayanti Mitra", "rating": 3, "content": "I am using this app from quite a few days and liking it. But sometimes, the app stops playing in background when I am working on a different app even if that is not something to do with audio or video, which is disappointing and is an hindrance in multi tasking. And this happens at times, not always. Looking for a solution."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Timothy Jairaj", "rating": 4, "content": "Great app. A few comments: The new player can't be controlled via my wireless earphones. And both players don't contain chapter/intrabook titles in the contents UI. The Search could be made more helpful with an autocomplete feature or with a full catalog, like of authors, that's browsable, so that I don't have to manually search for items with fingers-crossed."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Chandrashekar Babu", "rating": 5, "content": "This app got me hooked on to books once again. Due to severe eye strain (as part of ageing), I could not enjoy reading books for more than an hour since the last three years. Now, with this app, I have begun to listen to them instead and feel connected to knowledge once again. As a frequent traveler, I find this app useful in keeping myself engaged with something productive (learning something new all the time). Thanks for this wonderful and value for money app."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Omkar Yadav", "rating": 4, "content": "The mobile application has the bug in the language selection interface. When selected 4 languages and clicked on \"Done\" button there is no action performed and the further process terminated. I had to literally close the application and reopen it for the same action. So please resolve so that this informative product goes well. Thanks"},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Ashwini Hajare", "rating": 4, "content": "collection is not as great as audible but it allows to listen to a lot of books instead of just one book as audible allows. But there are a lot of glitches in the interface. the app would stop for no reason. when i try to go to home page it keeps flickering and automatically selects options. i initially gave this 4 rating now revisng to 2.. probably i will unsubscribe if the errirs arent fixed"},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Tushar Kolape", "rating": 1, "content": "What is wrong with search UI, whatever I search , I'm only getting no results found. In first place, why you want me to search, show me some bunch of books. Atleast give me a filter option or show all the books option. From last half an hour, I'm wasting my time to search a decent book to listen, but didn't get one one in results. You guys really have visionless Product manager or whoever approves UI interfaces. And why are you showing me book tip as home page, show it as a notification."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Ravindra Pai", "rating": 1, "content": "While some of the features is good, it is usually unresponsive most of the times even if internet speed is good and app is updated. when we click on any icons there is absolutely no response. Even if the app is closed and then opened, there is no response. It is not a free service and inspite of payment, one is unable to access. So it is not worth it."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Anant Honap", "rating": 4, "content": "The app is good compared to the other options I explored, I can visualise my family tree and add all the necessary details... 1. It is not intutive, to ask next question, eg, do you want to add partner for this? Do you want to add siblings? etc. It's very mannual to add all the entries🥱😪. 2. sharing a perticular tree to someone is not possible, I wanted to publisize this. 😔 3. Cost wise it's too much expensive, and still not sure about the privicy as filling in all the details like mail id."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Joe Phillips", "rating": 1, "content": "Downloaded this for the nostalgia animation. Got to play with it a bit then bam \"start 14 day trial\" £86.99 a year after that. I'm not interested in the rest of the app and the animations ranged from spooky to really lacking in realism, but I didn't get to experience them all before the trail nag. Shame really I may have paid a flat fee if I liked it but an annual subscription for one feature is not for me."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "smurf 84", "rating": 2, "content": "Great if subscription was allowed. I cannot afford to spend £150 in 1 go to find my family or colour photos which is what I really need it for. Its the only app i have found that has the features I need and there has been a limit added unfortunately so now cannot complete my work. If subscription is able to be paid monthly then its 50 stars out of 5 but unfortunately I have to pay for 1 year when a subscription would allow me to pay for what I need then come back when I need it again"},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Richard Sochacki", "rating": 4, "content": "I am astounded by the number of ancestors there are on my father's side of the family and am yet to investigate the maternal side. The software is a fairly intuitive but occasionally I miss the notification to transfer information found such as photographs. I do wonder how this app compares to those from organisations offering similar services."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Michael Fleischer", "rating": 3, "content": "Glitchy and offers too significant a drop off in service from the website. Glitch examples include inaccessible discoveries or indeterminate loading when clicking a discovery. Drop off in service includes discoveries that can only be seen and accessed via the website (do not appear in app)"},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Brutal Carnage", "rating": 1, "content": "Awful. I downloaded it for the face animations but it only lets you have 4 face videos? Not only that but when you're selecting what face animation you want it doesn't tell you what it is. Also the heads move way too much, looking around too much."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Daniel C", "rating": 1, "content": "So far I'm very disappointed, especially in regards to being able to purchase their DNA info. You would think since it's on the Google market you could upgrade by using your Google account instead of giving yet another person your credit card info. Until this issue alone is fixed I cannot give a different review, because I can't use the app. They do NOT allow you to pay for DNA through Google account, only their much more expensive subscription. You tell them that they don't return your email."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Levent Aymelek", "rating": 1, "content": "Animations are not even remotely realistic. Distortions everywhere. I uploaded my own photos to test it, high resolution quality photos AMD after Animation I looked like an alien because ai does not good a good job at all"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Nimesh El", "rating": 5, "content": "This is the best app ever. I was reluctant at first to try a digital book vs paper. Nostalgic about the smell of paper and of turning pages. But digital books are the best. Eco friendly. All time accessibility ! I was in an isolated post for 3 months and could read ~ 30 books. That's more than what I have read my whole life. But Kindle reader is not good. Buy ipad mini and install Kindle app. Become the reader you always wished to be ❤️"},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "D. Tsoi", "rating": 1, "content": "I have used Kobo for a while now. I started using it when it was owned by Indigo books. At the time it was as good as any other ebook/reader out on the market. Unfortunately this is not the case 10 years later. First the good stuff. Kobo does have a large selection of ebooks to choose from. They have added audio books to the selection over the years and I have never found their interface to be overly difficult to use, this however is it. Unfortunately the app lacks lots to be the best."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Bradley Kirk", "rating": 5, "content": "Fantastic app. Having your favourite book to hand on your phone at any time, just incase you need to read it to pass time unexpectedly but didn't bring a book. Ideal. It's easy to use. Just look for the book your after and get it or pre order and they let you know when it's time for your new read. Excellent."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Kris Mendel", "rating": 3, "content": "For the most part it's a really great book app. Only problem I have is that you can't see page number (in relation to the whole volume) on any of the books. Just goes on a chapter-by-chapter basis and shows %finished. Even just having the option somewhere in settings would probably bring it to a 5 for me."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Dyane Stewart", "rating": 1, "content": "update: now even more titles wont download at all. and no one on kobo team can fix this. i cancelled my subscription. why does it take over an hour to download each audiobook? they just don't download quickly, and will stop completely if you leave the app and do something else. I'd like to keep being a member of the club, but if there is no solution to this, well..."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "simon crisp", "rating": 1, "content": "There seems to be little control over audio books and random places for them starting. For example if I click on the 2nd track it takes me to chapter 44. If try using the bar to scroll within a track it could end up anywhere in the book. Incredibly frustrating to use."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Marcello Fiore", "rating": 3, "content": "It's a bit of pain searching for epub files on the hard drive. You have to select each one individually. Before you could just search epub and it would bring up all the epub files on the drive, then you could bring them all into the program at the same time. It was way easier."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Roberto Carlos Calderon", "rating": 5, "content": "Great for the environment. No need to cut down trees to make paper for books! And very convenient for saving space for physical books. I can carry as many as I can on my Samsung tablet and not having to continuously be buying book cases or book shelves to store them in. All the books are at the palm of my hands."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Julian Zarate", "rating": 1, "content": "Consistent problems syncing chapters between desktop and mobile; half the time I close a book, it doesn't save my last spot; and I can't expand the synopsis on any book in the story. Good service, terrible app."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Erik Nielsen", "rating": 4, "content": "Convenient way to pick up books before they physically release or actually hit shelves Had some issues with my place in a book being reset but it is pretty easy to navigate back depending on the book and if you remember to tab the page even more so"},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Penny Knowlden", "rating": 4, "content": "Mostly l love this app. Great for books but the audio books keep stopping. It wasn't always like that so I don't know if it is a Kobo or a Samsung 'upgrade 'which has caused it."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Daniel McMinn", "rating": 3, "content": "Wish I could rate this Amazon alternative higher, but I constantly struggle with highlighting not working on my Pixel 3, even after a reinstall. I select text, click a color to highlight, only to have the selection disappear without the highlighting. Sometimes the selection also changes shape in strange ways unrelated to the movement I make."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Zach Folkman", "rating": 2, "content": "I like the audiobook catalogue but the app will stop playing audio within a minute of using any other app, won't run in the background at all. Only works when I have the app open. When I put my phone down and the screen times out, it will stop playing after anywhere between 10 and 45 minutes. I was able to get through one title, but this bug is making it nearly impossible to get through the second. Would try a third, but the premium plan won't even let my buy a third for the first 30 days."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Eugene Yamnitsky, DrBA", "rating": 3, "content": "Recent changes degraded the experience: 1. I used to be able to click Title Details, and get a web page, where I could click on the series link and get all books in that series. Now, if I want to know what the next book is I have to google the series, and find the right post with the order of books. Please fix this! 2. The sleep timer page has just shrunk... the selections were large, amd now they are crammed in a small space. Makes it hard to see at night."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Doug Esplin", "rating": 2, "content": "The app desperately needs a workable sleep timer. If you haven't fallen asleep when the timer runs out, you have to grab the phone and go through the process again. At the very least the app should remain in sleep timer mode so that you can just push the play button to start the timer again. The slider to set playback speed is also very inaccurate. They should have some preset buttons. Until these features are corrected, I am converting to MP3 and listening with Smart Audiobook Player."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Faye Morris Newman", "rating": 3, "content": "Love audible but I do find the app quite hard to navigate sometimes. Needs to be easier to find the next book in a series for example. And whilst searching for a new book to read.. the navigation around searches isn't very user friendly - when I look into a book details, then go back I have to start search from scratch again, instead of picking up from where I was in my scrolling. But great selection of books, enjoy the free ones to tide me over until the credit drops in!"},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Caleb B.", "rating": 1, "content": "Lowered from 5-stars down to 1 because of changes to the purchasing options within the app. You can now only purchase using credits. This means that all books sell for the same price. I would often buy books with my credit card that were cheaper than the price of a credit and then save my credits for more expensive ones. There is of course still the option to shop on Amazon, but this has its own cumbersome issues as well as defeats the purpose of accessibility that the app is suppose to provide."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Jason Ferguson", "rating": 2, "content": "The ability to purchase books without official Audible \"credits\" has been removed. After the monthly fee you are now provided with one option of spending $40 for 3 credits. Audible has sold it's soul. Changing the product at such a fundamental level is surprising. The obvious goal is financial. They were too fearful to simply raise the fee and in turn made a major mistake. I will leave this review and find a new platform."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Charlie Goodrich", "rating": 1, "content": "The player has always had problems running. At first it would shut down when using the navigator every 10 minutes but now even with the app up front it won't run for more than 20 seconds before turning itself off. When it first got really bad beginning April I found many others were having the same problem and there were some fixes, none of them worked. Been waiting for Audible to do something about that but it doesn't look like it will happen. Now they are limiting purchasing which I'm guess..."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Lee Smith", "rating": 2, "content": "This app WAS easily 5 stars until they removed the credit card purchase option. As everyone else has stated this is clearly intended to rip off the unsuspecting. I have never purchased anything with the credit card option, but had planned to do so in the future. Also, I like to see the price of the book I am purchasing with a credit. The functionality of the app is still very good, hence the 2 stars, but the purchasing change leaves a VERY bad taste in my mouth."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Melissa Norcross", "rating": 1, "content": "Latest update SUCKS! Taking away the credit card option to pay is like a slap in the face. When you can only purchase books with \"credits\" and are unable to buy...for example a $1.99 book with a card. So they want you to buy these \"credit\" bundles which cost like 39.99 for 3 credits. So have to use a credit worth 13.33 for a 1.99 book. Uhhhh don't think so! Unless this is changed they will be losing a customer ASAP! Very disappointed because I'm an avid reader/ listener."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Meg G", "rating": 2, "content": "I hate the new updates and changes to the app and services! They took a great service and made it terrible! I liked having the option to buy my book OR use my credit. Now we have to use only credits and buy more! Also, when looking through books, if you click on one and decide to go back to the list, it doesn't take you back to where you were. You have to start all over. Rather annoying.. I will be looking into other audio book services if they don't fix this soon."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Shujath", "rating": 5, "content": "1. After setting the page to download also it is loading for a brief time when switching tabs. Why can't it just go directly to the left over place. 2. The define feature should be improved. The definitions are very basic. 3. Should add \"read later\" option which can sync through desktop and mobile app. 4. There should be an option to change background colour for eye friendly reading as available in Firefox reading mode."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Jules Beach", "rating": 5, "content": "This was exactly what I was looking for. Straight forward, can search for anything Inc events on now, or where to look when they are on at any particular date or time. Simple to use and pretty precise, which depends on your device too. Gotta say I love it 5⭐"},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Terry Dactahl", "rating": 5, "content": "Awesome 👌 The need to re calibrate Gyroscopic location is annoying,Being a comlpete novice to using a Telescope has made a instantaneous ability to allow anyone anywhere any-time the gift to view your Optical Delight."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Ron Hayward", "rating": 1, "content": "In the beginning, years ago this ap was spot on, very accurate. I've tried installing it on every new phone I get and as with the first install with my 1st smartphone after nearly a year it went bizerck and it's display went upside-down. With each new phone I've downloaded again to see if it would work as it did in the beginning. A complete failure each time! Of course I try to recalibrate it, but to no avail! It has always shown the constellations and star names, but never accurate!"},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "The PC Tuneup Guy", "rating": 1, "content": "The view in front of you is constantly spinning, never stops. I've calibrated a million times. I'm dizzy and exhausted."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "S R", "rating": 4, "content": "It does everything I want it to and it's pretty damn accurate. The only thing missing is maybe something that sends reminders when celestial events are visible from my location"},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "A Google user", "rating": 4, "content": "This is a very useful app to help locate stars. I have a few issues though, which I hope the developer can address. 1. Upon loading, it always focuses on the nadir, which makes no sense. Is there a way to get it to focus on the horizon by default? 2. I have to press the mode icon 3 times to get it to allow manual navigation. 3. Orientation. It only allows portrait view. Even when force horizontal is enabled, the text is still in vertical view. If these can be fixed, I'd give it 5* :)"},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Bossi", "rating": 2, "content": "It would be a mediocre product if it could ever seem to calibrate its directions properly. I can be looking east and it'll think I'm looking south. I've had this issue for years across three phones, while other similar space apps work fine. ///// Another issue is that it does not include any guidance of what each of the on/off icons are for (though most are easy to figure out by toggling on/off if you have some basic astro skills, you should NEED to have those skills). ///// It's pretty, but it's a very bare bones app that lacks features you'd find in most other apps (even the free ones). It appears to lack all of the following: (1) Objects of immediate interest that are kind of a low-bar for apps like this, such as comets, asteroids, satellites, and space stations. (2) The ability to hone in on or filter explicitly for neat astronomical stuff like black holes, gamma ray bursts, pulsars, recent supernovas, etc. (3) The ability to track/forecast positions of objects, or to change dates/times. (4) The ability to tap on objects to get more information about the objects, its coordinates, etc. (5) Doesn't even include most of the stars you can see with the naked eye."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Jude Missall", "rating": 2, "content": "The app itself seems to have had some care in its creation, but unfortunately, at least for me, I noticed severe sensitivity issues when using the location. While this can be superseded by the hand motion, it doesn't excuse that a major aspect failed critically for me after multiple tries. I hadn't even been able to test the accuracy of the app due to this, let alone, enjoy it."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "naveen kumar", "rating": 3, "content": "Overall experience is good but just like any other app this one too have some issues which needs to be addressed. 1. Whenever we try to download something, the progress bar in the notifications remains same even after the download completes. 2. In the books sort if I select sort by release date I do see lot of upcoming titles popping up, would be great if we have extra filter option to exclude them."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Sahil Patil", "rating": 1, "content": "Urgent update needed! REQUEST: 1: Can you please put subtitle/ lyrics option while listening the audiobook as it helps us to note down the important points. Eg. Spotify provides subtitles to read the song. 2: Please give an INDEX in the audio book so that we can listen as per our choice and can manage the book easily. As we are not able to keep a track of audiobook! Thank you"},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Shrey Sunil", "rating": 5, "content": "I am not into reading books. But I love gaining knowledge. This app has helped me create a new habit for myself. A new platform to gain knowledge. I have one suggestion though. Would love it if the app was compatible with Android auto. This would be a perfect way to utilise time wasted in traffic jams and commute to work. Would rather listen to audiobooks rather than music. Update - Looks like the review was responded to. It's now available on Android Auto. Here you go. 5 stars. :-)"},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Bipin Acharya", "rating": 4, "content": "The app is really awesome and I am enjoying it. I am facing a problem with the subscription. I want to go for Marathi subscription but I am not able to update or cancel the subscription as the payment is through GooglePay. It is neither visible in the Google Play subscription list for me to cancel. The mail support team is also not able to help me out. Irrespective of the payment method, the user must have option to cancel or terminate the subscription in the App without condition"},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Akshay Sulakhe", "rating": 4, "content": "App is good...smooth, fast. Some speakers are really awesome. I am not a big fan of ebooks..but audiobooks are really good. I gave 4 star, not 5 for lack of dark theme. I mostly listen during the night, before sleeping. In the night, that white background is very bad. Once there is a dark theme, will revise my ratings as well."},
{"app_name": "Storytel: Audiobooks & Ebooks", "app_category": "Books & Reference", "app_installs": "336,396", "user_name": "Divya Kishore", "rating": 5, "content": "Lovely app ....gives a splendid experience for the user ...each book creates a great experience. Just a suggestion when listening to a book add a option to continue the listening from the time where it was last heard. So it will be continuation for the user. As if now when I click the prelistened book it starts from the beginning again."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Andy Coleman", "rating": 4, "content": "Can be a bit vague and it's easy to follow the wrong lineage , sometimes it is reliant on other people's family searches but on the whole it's a helpful tool as long as you double check all your facts ."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Ayanna Duck", "rating": 4, "content": "I like using this app for my family tree and I like how it matches me with others who I may be related to. Being able to save pictures and audio is also a huge plus. However there's a limit to how many you can do for free and the \"yearly subscriptions\" are far too much in my opinion."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Stephen Lovell", "rating": 3, "content": "Quite a remarkable watching the colouring! I like it! I have downgraded it from 5 stars because when I try to add a fact there is always an error message telling me that something went wrong. Also I rarely get the option to instantly save records to an ancestor."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Mody Thomas", "rating": 4, "content": "Wonderful app. However, when colouring a monochromatic photo the shade below the eyes look a bit awkward as it is dark as the eyebrows"},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Don Van Blaricom", "rating": 5, "content": "I'm a relative new comer to the management of a family tree. The one thing I do appreciate are the matches from other trees. It was a bit overwhelming at first. Once I relaxed and took them one at a time, they worked very nicely. I like the fact that you can acknowledge the person whose information you are using. So far, I've been able to trace my dad's ancestry back to the 1500's. Thank you My Heritage!"},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Christine Castelli", "rating": 1, "content": "Automatically charge for a subscription I never purchased. I was automatically charged 299.00 for a subscription I never purchased previously. I have made numerous attempts to get this corrected but to no avail. As of present, I'm going to have to contact an attorney. Trying to cancel this is apparently a super secret."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Kyle Chatterton", "rating": 4, "content": "I wasn't really sure what to expect, but the updates on the progress kept the anxiety of wanting to know that more eager. Mine turned out I was just basically English 79% and all bets were lost with friends who thought otherwise. Disappointed? I thought I'd be more of a mutt lol"},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "THE S", "rating": 5, "content": "Very good and user friendly with different features like coloring old photos and searching in data base the only downside is not all things is free if you want the full pack"},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Jenny Marsden", "rating": 5, "content": "Excellent genealogical app with lots of extras (educational trng & photo enhancements). Resources not available on other genealogy sites. I use this program in conjunction with other genealogy programs to maximize my research experience."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Loyiso Mvana", "rating": 1, "content": "This app is confusing and frastrating. I have the MyHeritage Family Tree Builder on PC which I like. My expectations with this app were:- - Seamless full access to all saved info from both Windows and Android devices. - Fairly similar UI & functionality on both devices Instead:- - Android app is different from Windows App in name, UI, & functionality - Difficulty accessing web saved data, site timing out - Couldn't get equivalent Windows functionality & experience - Mid session log-outs & & &"},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Young Blaze", "rating": 1, "content": "So I was only able to do 2 animations before it told me to upgrade to 200 dollars? And to be honest, I couldn't even view the animations correctly due to my phone crashing, so i couldn't even see if it did a good job to even sign up for atleast a trial, so guess it's not worth it just for that"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "b m", "rating": 3, "content": "I like reading books and I have my preferences. But the search results and the recommendations are often catered to push the regional books instead of having a mix. Despite adding multiple filters, it pushes the search results that are nowhere close to what I like reading (even after knowing that I do not read the books being shown again and again). I really do wish the search results would be more refined and accurate."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Sujit Liddle", "rating": 4, "content": "Nice. A couple of niggles. 1. Unable to zoom library view. Tiny book icons, impossible to read. Have to download blindly, open the book, and then decide whether I want to read it now or later. 2. Cannot disable annotations. Every few minutes instead of scrolling, some text gets selected and then I have to close the annotations interface before I can continue reading."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Rohit Kr", "rating": 2, "content": "The app has a lot of shortcomings. First it changes black to grey on my phone every time when I start Kindle app. I have to restart phone to go back to my default Black color on home screen. It also controls the brightness of the phone. The screen becomes brighter on using the app and I can't change it till I restart. This discourage me from using the app. If you have a lot of books. The Library setting seems very archaic to organize them. No feature to transfer books or merge accounts."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Renie Doherty", "rating": 4, "content": "Since last update 2/22, 1. have a sample that will not remove download from device, despite having purchased the book and have it downloaded. 2. Also having glitches of downloaded book's not showing up in my library. I must do a search for them then looks like it takes me to the store to purchase again where I can choose read now. This happens randomly to a title. Can't figure a pattern to this. Love this app for years. Hope this can be fixed soon."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Gretchen Johnson", "rating": 1, "content": "Crashes constantly on multiple devices. Very clunky user interface, can't delete books without going to Amazon page (manage content & devices), won't remove expired library books after several attempts. App seems to be ignored by developers as these issues have been present for years. Won't sync correctly across devices. Difficult to navigate in book itself. Magazines impossible to read & navigate. Getting to be a useless app."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Megan Carter", "rating": 2, "content": "I love my Kindle app. Used for years and struggled through other issues (crashes, library disappearing, restarts) but I am just so frustrated with the continuous scroll bar being on the right. If I turn the page it is on the bottom. Being right handed I hold my phone in my hand and scroll with my thumb. Can't tell you how many times it thinks I want to jump pages. If we had the option to move the bar to the left or right so people could have their preference it would save lots of aggravation"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Cheryl Mizell", "rating": 5, "content": "I love reading on Kindle apps! You can make the print bigger or smaller when you need it, highlight text in multiple colors which can later be used for quick notes review or exported to quote in presentations, have all your favorite books accessible on all your devices from anywhere or at any time, be able to purchase (or download the free specials) the most current or classic books that interest you at the click of a button, and organize them in your library your way. It's a reader's dream! ❤"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Michael Glück", "rating": 2, "content": "I have been very happy with this App now for years and would give it a solid 5*. But I really like to read and listen to the same book depending the situation That worked fine until it didn't anymore. Suddenly the controls play pause volume no longer work using external controls like earpods or Android auto . Thus has now been the case for months .. Hope kindle will fix it eventually. Especially in the car not having the external controls is not good."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Jenny Christensen", "rating": 3, "content": "Doesn't follow along. If I let my device sleep or close app, when I come back to my book it's rarely in my last spot. This is a newer issue. It used to work great, but a couple months ago it stopped. It's really irritating to have to skim through to find my spot. Sometimes I overshoot and read something I'm not to yet. I know it's not a huge deal, but it is annoying."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "John Paepke", "rating": 3, "content": "Download Queue notification can't be dismissed. It seems to display any time I download a book that's part of a series that I own. It says \"Downloading 4 of 6\" as an example. I just installed this app for the 1st time on my new Galaxy S22, but apparently this has been an issue for at least three years according to a Reddit forum, so it's unfortunate that it hasn't been fixed."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Susanne MM", "rating": 2, "content": "Loved this app for years, makes borrowing books and magazines easy. However, it's difficult to figure out how to return them once you've read an item. Also, it all of a sudden decided to control my blue light filter. I never have that feature on, I like my screen to be white, but now when I go into the app everything is orangey-beige colored and there is no option to control that."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Maxim Villeneuve", "rating": 5, "content": "Perfect for reading books during a downtime at work. Would prefer physical copies, but this is more practical in a easy to get dirty environment, like working with inks..."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Sarah Bennett", "rating": 3, "content": "I like Kobo and have been using for years however it often fails to track progess and shows books as unread. This is really annoying as I then have to scroll through chapters and pages to find where I'm up to."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Jon Sands", "rating": 4, "content": "I really like Kobo and their e-readers and would give them and their products five stars, but as far as the app goes the loading bar can be a little misleading, telling me the page has loaded when it hasn't, and it can take a little while for the page to load in. Usually it's pretty good though."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Paul Burger", "rating": 4, "content": "Great stories. Very clear text. Good pictures. It remembers where you left the text. The user interface is not the most intuitive. Nevertheless, I love the stories and how easy the app makes reading"},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "D L", "rating": 3, "content": "Decent app. Wish it would also show in the 'Home' section , the book just finished and suggest other books written by the same Author. Would also be nice, since it tracks , to have new upcoming books of Authors that you have in your library shown in 'Home' or under upcoming books you might like. Like a notification. Not the most intuitive App."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Amanda Green", "rating": 4, "content": "Easy to use. Rarely have delays or freezes. Would be great if they could add an option to have the clock display om the app and kobo devices so u can see the time if u need to (I.e when reading at the drs office, or other times u need to keep an eye on the time for an appointment etc)"},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Veronica Vermeij", "rating": 4, "content": "I love the app, the only issue I have is each time I buy a new book about 80% of the time I need to log out then back in so that the book goes from preview to purchased, this then changes all my settings back. Other than that great app."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Cassandra Irvin", "rating": 2, "content": "Audio books now work poorly, used to never have an issue. If the screen locks it stops playing which is becoming consistently annoying. Even if I leave the window open it eventually acts as unachievable and turns off. Thinking of switching to audible."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Olivia R.", "rating": 5, "content": "My only suggestion would be to add a way to either sort my wishlist by sales or a new tab in the store for only sale of my wishlisted books. I would be buying alot more often if I could more easily see these specific sales. Otherwise it is a very good app with a wide variety."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Kulwant Singh", "rating": 1, "content": "After the latest update, all of books are vanished from the app. I had to reimport it in the app. In the process, all highlights, bookmarks, notes etc are gone forever. Very frustrating......m"},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "John Scott", "rating": 5, "content": "Loving it so far! They have way more light novel titles that I've been wanting to read than Kindle, although they don't have Redifining the Meta at VRMMO Academy. Kindle still does. For now."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Josh", "rating": 4, "content": "Love the app, really like that multiple devices sync to what page i left off on. One improvement suggestion would be adding a night mode where the background is black and text is white"},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "T. L. Haworth", "rating": 1, "content": "Generally Buggy and Slow I had been buying epubs from kobo, but it's been getting more and more difficult to download them. So I tried to use the app, as recommended. Now it just doesn't show me anything. This is very disappointing and I won't waste my money on them any more."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Terry B", "rating": 3, "content": "Please don't reply to this review with a response that says you're happy to help, contact us. Instead, fix the problems that your latest update caused. As with previous complaints, there is a 70% chance that the last page read will not be saved, so it's all up to My memory. Worked fine before the update. Other issues noted, when starting to read a new book from my library, it takes a few openings before it appears on my home page of latest reading."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Christina", "rating": 1, "content": "Its not always the most user friendly, but it has a great selection so I kept the app. However, they have updated it so the pricing is not transparent. It is not easy to use anymore. Now you cannot purchase books, only credits. The lack of transparency on the cost of the audiobooks was really the last straw with me and this app. On top of all that, the price of credits was increased too! It seems sketchy and greedy to me."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Jakobe Swenson", "rating": 1, "content": "I've enjoyed audible for years and purchases hundreds of titles happily. Some features I really enjoyed, like the daily sales have started disappearing, and suddenly they removed almost every feature I enjoyed. I'm not able to take advantage of sales anymore as far as I understand, I can't even see the prices of books. The cost of credits also increased. I've just gone from extremely satisfied to I'm not sure I'll ever use this app again. What a waste of so much of my money..."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Ben Pulido", "rating": 1, "content": "I understand the complaints about lack of purchase capabilities within the app. But I can't even make it that far. The app crashes on open every time I try to open. Reboots Force quitting looking for new updates. None of it helps. After the most recent update the app is literally unusable. Edit: A reinstall seems to have resolved the issue for now. But that means I lost my downloads and in some cases to place in my books."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Kim Moran", "rating": 3, "content": "I have been listening to two separate podcasts live with multiple episodes. When I get to the last 1 or 2 episodes, it won't play. It says playback error. I tried to download the episode the first time it did this and it is still showing a can't download message and is still trying after I went into the episode and clicked stop download multiple times. Now I'm to the end of the second podcast series and again, playback error. It's so infuriating. Why am I paying for premium service?"},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Kelsey LaQuerre", "rating": 2, "content": "What happened?? I am super disappointed in the fact that I am no longer able to see the purchase price of a title nor am I able to just purchadr a title with my credit card. Some titles cost less than a credit and I would rather just outright pay for the title. Also, getting rid of the ability to purchase titles on sale is completely ridiculous!! I've been an audible member for years. But I'm very unhappy with these changes. Maybe it's time to look somewhere else moving forward."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Dona M", "rating": 1, "content": "I absolutely hate this new update. I hope they realize that they are losing money with this. You can only buy with credits now, and it's crazy. I'd much rather purchase a cheap book than use my monthly credit. Now I'll just use the app less or find a totally new alternative. Also with all the previous complaints about the hard navigating, you'd think the update would help. No not at all, navigating discovery is absolutely counterproductive. Audible has gone downhill."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Liz Walker", "rating": 2, "content": "The app is pretty decent, but I think a huge missing feature is being able to cast the audio to a Chromecast, hence the low star rating. It's a very important feature to me for any media app. We have a full home audio system, it would be great to be able to properly cast and listen to books while doing chores without casting my entire device. Another nice addition could be made to the sleep timer. Love \"End of Chapter\" but a \"End after X chapters\" would be great!"},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Peter Pipelias", "rating": 1, "content": "After some recent update I no longer have the option to pay for a book and not use my credit. I have the \"buy with 1 credit\" option, and under more options I can put it in my wish list. Maybe I'm missing something, which is still a problem. In any case, I now need to go to a browser to locate the price just to see if a title is worth my credit. I believe it is a deliberate deception tactic."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Amelia Kouba", "rating": 1, "content": "They've eliminated the ability to purchase not only sale items but books in general. You are only allowed to use credits. A credit is currently USD $7.95 or $14.95 for Premium. They've eliminated the ability to see the price of a book without using a credit. I have purchased numerous books the were priced under the amount I paid for a credit. I will now be forced to use my credits to overpay for books. I've seen Whispersync from $1.99 to $7.49 - again forced to pay by credit only."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Andi S", "rating": 4, "content": "I have had this app for a few years now, and listen to it daily! I love that I can buy credits 3 at a time and if a book is less than the credit price, that I can just use my card instead of a credit! I do NOT like the new update, the things I love are gone. No more purchasing with a card, no BOGO. It's ridiculous! I can see many book lovers being discouraged by this, including me."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Jesse Kersey", "rating": 2, "content": "I have spent a great deal of time and money in the Audible app, and the previous version of this app was 90% perfect. However the latest update feels like a huge step backward with significant limits to navigation particularly between related series, and payment options have been removed so that I have to leave the app to make any payment decisions outside of my regularly scheduled credits. These changes disrupt the user experience and have led to less purchases due to the inconvenience."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Ruth Mirau", "rating": 4, "content": "All stories are clearly read, some sound monoton. There are a lot of good \"included books\" that you can listen to for free. It has happened once that I bought an audio book through amazon and it didn't show in the audible app, otherwise it works smoothly and it gives monthly \"credits\" so you can get a book for free. ... Overall, it is worth it."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Hannah Smith", "rating": 1, "content": "You can't buy books with a debit/credit card any more! This is a joke! I have been a loyal member for years. I save my credits for more expensive titles and always buy both the Kindle version and add audio. I could buy the audio for a discounted price if I had the Kindle version. Now I have to buy $40 worth of credits for a $3 to $7 title. Like Amazon needed to make more money, they are screwing over customers. This better change back soon or else I'm finding a new audio app."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Aparajito Bhattacharya", "rating": 3, "content": "The little circle to the right that pulls out the contents is extremely inconvenient while scrolling, as others have pointed out, many of us end up dragging on it while swiping up one handedly. An option to move it to the left of the screen might be solve the issue. Also, since around a month or so ago, the app automatically dims images in dark mode, even when image dimming is turned off."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Anushtup Haldar", "rating": 4, "content": "Wikipedia is a very good app/website. My suggestion is for mobile website/app. I'm sure this would benefit many. Each article should begin with a hyperlinked list of sections & sub-sections, so that one can get to the desired section immediately & not keep on scrolling. Wiki is often used like a reference book now. It's no longer just a collection of articles, that one has to start reading from the top. This suggestion would be esp useful for mobile accesors, as more scrolling is involved."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Raghavendra Naik", "rating": 3, "content": "Rating for the app, not for wikipedia as a whole. Good: 1. Offers easy navigation panel for articles. Bad: 1. The app loses internet connectivity for no apparent reason, even when other apps can connect to internet. 2. The pages do not keep the information offline. Technically, no use of such app. You can better live with a Web Browser."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "New Delhi General", "rating": 5, "content": "Best app ever made. It is the global standard of information. Anyone could read any article on any topic. I read for historical events. Wikipedia is non profit organization. It has no ads to disturb you while reading articles. And users can also edit the articles, if there is a mistake. Also when it's space go up to 100 Mb's, I just clear it's cache, and it's space comes back to 22-24 Mb's. Probably the best app I had ever seen."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Nandana MV", "rating": 4, "content": "I love this app. It has made researching a lot easier and is very user friendly, letting you edit an article, save it, read it later, do anything. There are some issues,(such as not being able to delete a reading list) but they are relatively inconsequential, so don't let that stop you from downloading this."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Krishanu Chatterjee", "rating": 5, "content": "The latest iterations of this app have improved navigability and have also added several customisable features. I don't think this version has any major shortcomings, and I am only referring to the the interface and the other features I cannot comment on the technical aspects of this app because I do not know those subjects. Good going guys! Wikipedia is an asset to most common/average users like myself, and this version does ample justice to it."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Aayush Bharadwaj", "rating": 3, "content": "For the last few months; after some automatic update , all my saved pages, which were into hundreds, were deleted. At first I thought that it was due to my own doing and started saving afresh. But after some time all my newly saved pages kept on deleting regularly. I hope that in the new update you will address the issue."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Steven Dolbey", "rating": 4, "content": "Really good app. I do wish there was a setting to turn off the swipe to open the table of contents. It makes scrolling horizontally within tables a little tricky. At the very least, I wish the swipe zone was closer to the right edge of the screen rather than everywhere."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Antonio Tavanti", "rating": 4, "content": "The app is crucial to use Wikipedia content and has been made very good throughout the years. What I sorely miss is the ability to copy the link of the current view (be it a page or section). There doesn't seem to be any specific feature for this and the sharing button lacks the usual \"Copy link\" option that other apps have. I'm looking forward to this simple feature to be added."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Ryan Hill", "rating": 5, "content": "I really like the way Sky map is set up, the options are great, but I have a confusing issue (solved). You were right, Sky map didn't know my lat and long, I played with the settings and it's right on point now, thank you for your help. The constellations seem to be rotated out of alignment. As an example, Cassiopeia should be almost directly over head given where I live and the time of year, but the app reports it on the Northeastern horizon instead, even when I use search."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Heidi Santana", "rating": 2, "content": "used to be my favorite app bit for some reason recently the calibration is totally off. my phone shows high accuracy and I have no issues with any other apps but everything is way off now. it's great to have all the constellations but when things aren't lined up it's kind of pointless. very disappointed with whatever it is they did to lose their accuracy."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Spotted Marley", "rating": 4, "content": "Really love this app. Works great on my Galaxy A51. One thing bothers me though.. the background is annoying. At night I want the whole background to be solid black. There is no option Ive found to turn off that black to blue hazy gradient thing that is permanently in the background. I can turn off everything else, stars, planets, etc. So why not let users turn off the annoying background coloring? Makes it less enjoyable to use in the dark. Please fix in the next version. Otherwise, its awesome"},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "oh hi", "rating": 4, "content": "Very good, I love looking at this to find planets in the night sky. However I have always had trouble with the default mode because the map wouldn't move with my phone. I figured out that my phone doesn't have a gyro and I have a solution to others out there with the same issue. First, open the app, then once you're in the map, tap the three dots at the top right corner. then you click 'Sensor Settings' then you click 'disable Gyroscope' And it's that simple! Hope this helps."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Jon Cutter", "rating": 2, "content": "I love Sky Map and it has worked well on all my previous phones but on the new Motorola One Vision it seems to cause all sorts of problems. It may be a problem with the phone or it may be a problem with Sky Map but whichever is at fault they are definitely incompatible.  When used on the Vision the phone compass / gyro seem to be disabled - not only for Sky Map but for every other app on the phone that uses the gyro and the compass. Hopefully there will be a fix soon, and as soon as there is then I'll re-install Sky Map on the phone, but until then I'll just have to continue to keep the old phone powered up for star gazing!!"},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Daniel Ralowicz", "rating": 2, "content": "Interesting app... Major problem is the compass is never accurate. The app will tell you if the internal compass needs calibration. This never works, even at high accuracy, it still is off by 90 degrees, give or take. There should be an actual manual calibration option. Not some silly flip-your-phone-for-twenty-minutes-for-no-measurable-improvement method."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Taz Tanz", "rating": 2, "content": "It has the sun rising in the west and setting in the east. I've tried calibrating, GPS Location, and manually put in my physical location and it makes no difference. North, South, East and West are correct on the map but the sky is 180° from where one can see actual planets, stars and constellations. Even tried to reload the app. Has the same outcome. It used to work at one time... maybe I woke up in an alternate Earth and galaxy!!!"},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "JML JML", "rating": 5, "content": "I love this app I've been using it for years and it has not disappointed me at all, you can view the planets the constellations and everything else expected in a sky view map. This is the one map you got to have. Because the other apps if you read the critical remarks about them all of them do not work except this one and I have an LG G7 Slim. Great app and i would recomend it to anyone. The adds dont even disrupt your viewing pleasure, they are very small and at the very bottom of the page."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Mark Thoms", "rating": 5, "content": "Excellent free astronomy app without ads and other \"upgrade\" nonsense. I like the visual perspective this app provides compared to similar apps and ease of use as a mobile solution. I would like to be able to zoom out further for a greater field of view as well as an option to lock on the horizon during time travel. Rated 5 stars for a good experience."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Roger P", "rating": 5, "content": "I'm lucky enough to have dark skies whilst living in a city. This app gives me a whole new night sky to look at and its so easy to use. I can't say if the names of the stars are right or wrong, but wow, the map fits what I can see and those little dots have names (or numbers). Great app and so well done. Further more, the ability to see where the sun is at night (in relation to where I am) is a proper eye opener. I love it."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Róbert Mihály", "rating": 1, "content": "It's barely usable, it is stuck loading something on each click. It freezes so that it cannot even be cancelled, I have to force close the app. This is buggy, back to the website."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Dondi Wood", "rating": 5, "content": "Expensive Update: I am in my 50s with early onset Alzheimer's disease with a fixed income and very little discretionary funds available to me. My previous review was based on a momentary of wanting more than I can afford. This is not the fault of the app. They have some amazing tools but in order to pay their researching department, people need to contribute to this cost. There are a handful of tools which are free. My only wish, is that they had a more graduated approach to your offerings."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Derrik Koehler", "rating": 4, "content": "I could say that for the money it cost for the premium plus package or whatever there should be more help with navigating the site and most important, the research aspect. For some reason or another whenever i confirm a matchand addupdated info to existing ancestors, it doubles or tripples that member and relatives.would be nice for $499 they would provide better info. Also, DNA matches should link trees or something. realy do enjoy the app other then that."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "unapologetically me", "rating": 5, "content": "I absolutely love myheritage. This is a must have tool for people looking to build their family tree. The dna test was accurate, the data bases they have available to tap into are extensive and the genealogy course they offer is so much fun. The course has alot of tips and tricks to get the most out of your research and tools and if you get lost you can always ask for help from one of their experts. Myheritage is a game changer."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "John Williams", "rating": 5, "content": "42 years ago (I was 12 at the time) my grandmother took me me on my first hunting and ficheing trip to the Salt Lake City Historical Library. I fell in love with my Great-grandfather's \"coming to America\" story. Even with all that time, I have not been able to link his parents to him. He has always been the elusive ancestor, but with the animative technology you're using, he has become real and reachable again. Thanks for helping me bridge the gap between generations."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Maggie Heard", "rating": 2, "content": "I am an intelligent 71 years old woman and I used Ancestry then decided to try this one because it's less expensive. Bad choice and now I'm trying to figure out how to cancel my subscription before the $$ is actually withdrawn tomorrow!! Not user friendly!"},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "TT nNaples", "rating": 5, "content": "Very complex, with so much information. MY COMPLAINT is how user UNfriendly I find it at editing tree information. Very frustrating. Overly time consuming."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Michal S", "rating": 1, "content": "Watch out! They renew the account and invoice! Helpdesk is difficult to reach! There is no telefon number to reach, only referred to use the app! The app makes it impossible to remove entered credit cards!"},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "michael peterson", "rating": 1, "content": "Donr use cant delete subscription very easy. Says to go to the play store but my playstore dont have it like it says in app. So dont get if u dont like a hassel to stop your free subscription. It also never came up with any discoverys."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Cynthia Medina", "rating": 5, "content": "I love that I can read my school textbook from Kindle. It's easy to highlight the text and search for your highlights - this is perfect for taking tests. You can also write notes and create flashcards. Kindle even recommends popular high lights for the topic. But the best feature, in my opinion, is the ability to link Audible with the text and have it read for you. This is great if your pressed for time."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Waya Askin", "rating": 5, "content": "I love having access to my library on my phone if I happen to let my Kindle battery run down. The app keeps track of the book & page no matter what device I use. The handy extras, like the dictionary, wiki & highlighting, are available on my phone as well as on my Fire. There is also a really cool function for people with a bad memory like me if you happen to come across a character you don't remember; highlight a name & you'll get more info. The ability to take notes is always handy. Great app!"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Lorena Terry", "rating": 4, "content": "I love this app, I LOVE it because I can have many, MANY books at my fingertips! As for me, I purchase books on Kindle that I don't already have physical copies of (with the exception of a few titles 😏). My one qualm with this app, is that I wish the play/pause button for the audiobook companion to some books would be much bigger. I feel as though I have to strain my thumbs & a few fingers to the very low, right-hand corner to press a little, tiny play/pause button and it's tedious. Please fix"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Suzanne Lee", "rating": 5, "content": "A great app. It's not one I was drawn to before even though I knew about it. now I have it, I have a reading habit. my mind has been expanded. I can see my reading stats, add books to wish list, get notifications when wishlist items become reduced in price, easily see other books by the author or popular books on the same theme. You don't have to spend a lot of money if you don't want to or you can, either way you build up a book collection without it taking up space at home. I enjoy this app :)"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Dion Ombler", "rating": 1, "content": "The app has a very useful feature of being able to bookmark where you got to in case you lose your place. The latest version which has just updated today has lost the ability to find those bookmarks so the act of bookmarking now becomes useless. Why has this feature been removed when it is so useful. The ability to find your bookmarks used to be on the main menu up the top, then it got moved to a submenu accessed via the ellipsis, and now it's gone all together."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Paul Pakozdi", "rating": 2, "content": "Very disappointed that it is no longer possible to navigate a book in any sensible way. Amazon has ruined the app for reading any book with references, footnotes or other hyperlinks. For example; you can no longer go back to the page you were last reading if you decide to follow a footnote. You are lost and must either remember the location you were at or fumble around in the TOC to eventually find your place. Apparently no user testing at A since this major bug would have been easy to catch."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "jetowl", "rating": 1, "content": "So the library came back but you broke something else in the latest update. All of the book images on the home page are now gone. And sync doesn't work for books read on the phone. Uninstalled and reinstalled. No change. How many negative reviews does it take for you to fix what used to work? The disappearing library trick is getting old. Since it's happening on multiple devices guess what...it's you not me."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Marius Malan", "rating": 1, "content": "Settings change at random, and has to be reset regularly. Very irritating. I am so tired of having to check the settings (font, rotation, line spacing etc) virtually every time I turn a page. The person who wrote this app tried to show how clever he is, without any regard to the ergonomics. If a reader changes a setting, that setting should stay like that unless the reader deliberately goes to the setup menu and changes it"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Victoria Gloria", "rating": 5, "content": "Fantastic app with lots of customization options for reader comfort. KindleUnlimited is hands down my favorite part of Kindle. I've discovered so many amazing authors and some of my favorite series because of it! So very worth the money for the monthly subscription. The only thing I would change is to have a yearly billing option available, or if there is one make it easier to find as we've looked many times."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Jami Stargel", "rating": 5, "content": "The convenience of having a Kindle is my favorite part of having it. Any book, magazine, etc. available at my fingertips any time. Kindle is also innovative, always adding new features & staying up-to-date with technology. A favorite feature I still love is being able to highlight favorite passages. Another favorite feature is being able to look up unknown words' definition. There are truly so many reasons to love a Kindle."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Bob Pennington", "rating": 2, "content": "I have used this app for many years years and now I have to leave. In the past I could use the publisher default font and now that choice is gone as it is a version of a Sans font. The Sans font is uncomfortable to read and Google Play Books offers a number of choices that looks like real book fonts. I'll check back occasionally in case it changes."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "tina halliday", "rating": 1, "content": "No matter what I do I cannot access the store.... it just stalls and then tells me something went wrong try again... updated and restarted phone and could access for a few minutes then back to same issue.... so annoyed"},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Cynthia Panka", "rating": 5, "content": "A good solid app. It holds steady without causing one to try to find their place in the story. I thought Amazon was good, but this system surpasses it. Wish I could afford more ebooks. I am handicapped and read all the time."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Vika Prasol", "rating": 1, "content": "Bad first impression. So I find out about this app from author I read and it was exclusive on it. I went to the app and immediately bought it. When I opened book I saw it has big gaps between words (when text size medium or bigger) because text alignment was centered to both edges instead of to the left. I contacted support service and there is began fun part. They said it's \"intentional formatting decision made by the publisher\" and adviced to make font smaller. First and last purchase."},
{"app_name": "Kobo Books - eBooks & Audiobooks", "app_category": "Books & Reference", "app_installs": "275,628", "user_name": "Paul S Mazak", "rating": 5, "content": "I love it's night mode. That's when I read most frequently. I also use text size adjustment. I would like text size to be customizable for each book. I wish there were more selections in the technical category."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Steinst96", "rating": 1, "content": "Recent update is completely anti-consumer. They will only allow you to buy titles with credits (even if they're worth less than a credit) that you have to pay for a subscription for at least a month in order to be able to purchase, and you can't buy them one at a time. You also can no longer benefit from sales on titles, like buy one get one free sales, amd it removes the ability to change payment and membership options on mobile, forcing you to go through web pages."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Row", "rating": 3, "content": "I like this service but they changed the payment system now so you can't just buy things directly. You have to buy their credits first which means every book is now the same price. This effectively made all of the books that were cheaper than the cost of a credit cost more and doesn't make the more expensive books any cheaper because you could have bought them with a credit before anyway. It's a change that will probably stop me from buying short books completely."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Danial Gibson", "rating": 1, "content": "I have just subscribed to audible, I listen at work for about 6 hours a day and thought it would be a good option, unfortunately the app closes down every half hour or so. I then need to get my phone out and re launch the app. It is so frustrating. I am so keen to keep the subscription but I won't if the app keeps closing down as it is too much of a hassle."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "Morgan Cherry", "rating": 1, "content": "It seems like the convenience of an app has been lost on the developers at Amazon/Google. I have no idea whose decision this most recent update was but it's awful. We can no longer choose to purchase books with a card on the app. If you want to even know the actual price if a book you want you have to go online to the audible website. This app has slowly become more and more user unfriendly and I'm disappointed. I hope anyone considering getting the app sees this and decides to go with another."},
{"app_name": "Audible: audiobooks & podcasts", "app_category": "Books & Reference", "app_installs": "1,329,363", "user_name": "StrawberryEyes", "rating": 1, "content": "This app is absolute trash. It's basically no more than an audiobook player and a library with really poor search facility, not user friendly and poor functionality. You can no longer purchase books, you can't tap on the author or narrator in the description to take you to more titles by the same people. You can't make adjustments to you own details. I never ever use the website. EVERYTHING I do is via the app, I'm not logging into my account every time I want to do something. Absolute trash."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "jose", "rating": 3, "content": "I put 3 starts because in dark mode you cannot see most of the info in some tables (like Brackets in sports), they appear with some color background that not allow to see anything. You cannot sort the tables the same way you can do it in the desktop webpage. Sorting tables is a very useful feature that should be in the mobile version of the Wikipedia."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Keith Moss", "rating": 5, "content": "Best user interface and functionality of any app I've ever used. So many convenient features. Smooth finish and many customization/theme options are available. I never have issues with this app being slow. Desperately needs a \"return to home page\" button for when you're knee deep in a rabbit hole of articles."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Andrew Holman", "rating": 5, "content": "One of those rare apps that: 1) Works exactly how you expect it to. 2) Doesn't decide to start blasting you with notifications one day. 3) Doesn't randomly break every other update. Small bar, but most of the apps in Google Play don't clear it."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Agent 187", "rating": 5, "content": "Great app! Beautiful graphics! Only issue I noticed, was diagrams do not fit on the screen at all like the browser version; you have to side-scroll alot to see them. The app needs a tablet-size screen to fully display diagrams"},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Dana", "rating": 5, "content": "The \"contents\" button on the bottom right seems to be a perfect solution to get to, for instance, Francis Bacon's death on his personal page and skipping all the claptrap about what he did when he drew breath and/or his historical significance/critical perceptions of him, but the only two options on his page are \"Francis Bacon\" and \"About this article,\" both of which do nothing. Not sure who's to blame for that but it results in this review. Edit: now that I have reviewed, it instantly works..."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Bryce Moyer", "rating": 3, "content": "Great app, but just found a bug. Moved a saved article from one list to another, it still shows up in list one, but options to move it act like nothing is wrong and the transfer was smooth"},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "C C", "rating": 3, "content": "I think my biggest turn off is that wikipedia has shifted from being a place you can rely on for accurate information. So many entities (companies) are using it as a way to promote themselves, by leaving out bad information. And if you try to update a wiki page, they won't post it if it is even slightly negative. In other words, wikipedia has become a platform whose motto is \"If you can't say anything nice, don't say anything at all\". So, a lot of information on wikipedia is now so filtered and so politically correct, that it does not paint an accurate picture. You can still use it for science type stuff, but anything remotely political (history, etc.) is not very accurate."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Marcus F-T", "rating": 3, "content": "Functionally very similar to the browser experience, if not less intuitive. Wikipedia is so reputable it deserves an overhaul to be wonderful, like the app discord is. Weird to try to get from tabs screen to home, tabs are too big and their previews too vague to represent what was being looked at on the article. And, links' previews are sometimes too vague, previewing the parent article, instead of the relevant portion that is being fetched."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Shubhendu Prateek", "rating": 4, "content": "My comraderie in self discovery and journey towards enlightenment. The contributors and editors here deserve an applause for keeping it off the dirt. Though one major flaw is that it doesn't open PDF files in the source link. It's like saying, we'll show you the stuff but to open the sources you'll need to consult the website."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Rocco Rockafire", "rating": 5, "content": "Almost all the information is here. Although it relies on the work and research of the voluntary online community, it's also reviewed and moderated for accuracy and quality. It is an especially effective resource for learning language as articles are frequently tranlated into various languages. Teachers and doctors hate this one easy trick!"},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Joshua Comer", "rating": 4, "content": "I really like this app a lot. I do wish however that there was a more convenient button for reloading a page without losing my place. I have to scroll all the way back up. The English Wave Function page seems to be broken. It doesn't load all the way. It shows the full article for other languages, but not for English for some reason."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Daylan Volk", "rating": 5, "content": "Works perfect as long as your phone has the ability to be a compass. Really cool features for finding things and even shows stuff in the past and future. Looking around with the phone matches up almost spot on. I would like to be able to tap on objects and get some information on them, that would be pretty cool."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Luke Semler", "rating": 1, "content": "Was great for 3 years. Updated the app and all of a sudden an error message comes up about my phone it's missing a compass or accelerometer. The result is the app only works in manual mode. Meaning the app no longer works as it's designed to. Why? What have you changed in the app for this to setup working as it used to? My phone hasn't changed."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Graham Algeo", "rating": 3, "content": "Lovley visuals, the ability to find an object track its course to find out where and at what time it will rise above the horizon is brilliant. It is a shame that this is hampered by (as with other apps) the pointing being so off, (almost 90 degrees sometimes, admitted it could be my phone) add to that there is absolutely no option to recalibrate or adjust the pointing in the menu. Maybe that could be added to the next update. It could be very usable otherwise."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Roman Onik", "rating": 3, "content": "The position of stars and the moon are off by a significant amount, perhaps 45 degrees. Useful as a sky map but the auto positioning mode does not work. Yes, I did recalibrate the sensors a couple of times, and it did not help. Could be my phone's fault I suppose, but the GPS compass appears to point the right way."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "SpEd", "rating": 5, "content": "One of the first Android apps I ever downloaded, probably around 2009. I've had it installed on many devices, and sometimes I've forgotten to download it at all. I've never used it for any practical purposes, mostly just for fun to pass a few minutes at night in the spring and summer to help locate constellations. Never had any problems with it; every time I've ever tried to use it, it's worked great. No crashes, doesn't chew up a bunch of data or resources. Does what it's supposed to do."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Ken Lam", "rating": 2, "content": "The updated app doesn't seem to show current position properly. It says the sun should be 30 degrees above the horizon when it's just sunrise. I've tried on multiple devices and Android versions, and they all malfunction in this way. Specifically allowed location permissions to the app, confirmed high accuracy, but still off. However, the time travel works like champ. Hoping this gets fixed."},
{"app_name": "Sky Map", "app_category": "Books & Reference", "app_installs": "489,595", "user_name": "Steven Calvelage", "rating": 2, "content": "Opened this app up for the first time in about 6 months this morning at about 5am.   Everything was way off , almost 180 out of position.   I did several calibrations,  and still the same result.   After about 30-40 minutes of messing with the settings and calibrating,  I realized that the time travel was stuck on the \"next sunset\" setting as the default.   How does that get defaulted to \"Now\".  After uninstalling and reinstalling it remains on the \"Next sunset \".  Please fix."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "S N", "rating": 1, "content": "I'm really disappointed with the interface and actual utility of the app. If I had known id get so little out of it I'd rather have saved my money . I need a refund immediately."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Kati Smith", "rating": 1, "content": "The Captcha verifyer doesn't work well. It comes up sometimes, sometimes not. I have not had a successful log in to the app."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Jeleckami P", "rating": 1, "content": "Not user friendly at all and not very helpful either. For such a high membership fee, I thought the member would have better access and research tools but not at all. Don't waste your money!!"},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Polina Galkov", "rating": 2, "content": "In the second year it stopped working. Doesn't allow adding or changing information, although I paid for the most expensive premium account. The support team is not responding. P. S. I sent e-mail describing the technical problems. So far I have not received any response."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "kytman diogenes", "rating": 1, "content": "I signed up for the 14-day trial subscription. I did not find it's good for me. For the test I had to provide my card details. But the app doesn't give you the option to unsubscribe, not even in the playstore you can cancel. Now they charge me $191.40 AUD, for a one year subscription, of something completely useless to me, 1 goddamn year! Careful guys, this for me is a kind of scam, I'm extremely angry! I deeply regret ever hearing about this company. Give me back my money!"},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Samantha E.", "rating": 1, "content": "I have loved everything this app had had to offer. UNTIL, they did a force charge on my card. It put me in the negative for the subscription which I have so far not been able to get a refund. I am hoping this can be fixed by the time I have to pay rent."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Ed O'Neill", "rating": 3, "content": "I signed up for the free subscription because im really interested, especially the photo animation. I'm already disappointed how much of the photo gets cropped out for the animation to work. Just got to use the app more and see how it turns out."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "LISA FRANK", "rating": 1, "content": "Crashes after you get a lot of people in your tree, instant discoveries disappear after you look at and apply one I can have 20 discoveries look at 1 and go ahead and approve it and then all the rest of them disappear and I can't look at them again until the next day. It bogs down after you have a lot of people in your tree I can barely use the app now because I have too many people in the tree (over 2,000)"},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Dorothy Stevens", "rating": 4, "content": "app is great for free. I will have to buy the premium to really go in depth, but for now it's perfect for me to start. It also sends emails and info to me that more relatives were found, if I confirm, then it automatically adds them to my tree."},
{"app_name": "MyHeritage: Family Tree & DNA", "app_category": "Books & Reference", "app_installs": "207,728", "user_name": "Noel David Pulleine", "rating": 5, "content": "I have become very familiar with this tool and find it's features amazing. The new features such as animating a still photo and having 9 choices of how you can make one smile. I rather like #8."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Vineet", "rating": 1, "content": "I have a lot of genuine issues with this app. Firstly the brightness, we cannot set a customizable brightness while reading. Secondly we cannot resize all the pages at once. Thirdly i have read a number of books and due to an update, most of them vanished. I hope Google solves these issues and help me to get my books back and fix these bugs asap."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Dr Karen M Sutton", "rating": 5, "content": "As far as I'm concerned, Kindle is the best $9.99 that I spend all month. Their selection of books is seemingly limitless and I like the option of being able to \"return\" a book to the Kindle Library and download another. They have Audible and there's an option in settings where one can tap the screen and it displays an animated turn of the page. There are also tons of fonts and theme layouts for your books. If you're a reader or want your child to learn to love reading, this is a great way to go"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Iris Pang", "rating": 5, "content": "This app has been great for on-the-go reading. Plus, with my Kindle Unlimited subscription, it's been easier than ever to meet my 2022 reading goals because of how many books are available for either rent or purchase in the Kindle Store. Overall, the app itself is smooth, intuitively easy to navigate, and great for accessibility. Even if you don’t use a screen reader regularly, the ability to read books with TTS makes it more cost-efficient and convenient to read regularly."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Ella Valentine", "rating": 3, "content": "What more can I say, other an app for reading digital books. But thats just it, its basically like reading a *BOOK* digitally. Maybe you can change the size and font of the text, and a little bit extra, but its not utilizing its strongest selling point -- reading books *DIGITALLY*. Basically, I want a scrolling option, cause its a pain in the neck to look up and down or move my phone, when its a stationary medium that requires you to \"turn the page\". I'm thankful that it's free but, ADD IT!!"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Jeff Phillips", "rating": 3, "content": "Could be better. Very difficult to update the brightness. Auto is too dim, so I found the setting once and put it on manual, now it's too bright but I can no longer find where it is. Developers have a look at how VLC does this, it's not that difficult. Can't just use the tablet brightness since it runs independently- doh. Text size adjustability is fairly good as long as you like small, medium, or huge."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Kris Beaver", "rating": 5, "content": "The kindle app is amazing especially for someone like me who likes to listen to books in the car rather than music most of the time. And I would recommend paying for the service monthly as most of the books become free when you do this instead of paying for each book individually. The only complaint I have is that I wish all the books had an audio version for when im needing to be hands and eyes free."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "CyberFrog", "rating": 1, "content": "Deliberately designed to drive accidental purchases. Upon reaching the end of a book there is a pop up enabled that offers purchasing the book you've just read as an audio book. This is easy to miss, and appears next to navigation buttons. It's also linked to one click purchase, which is non refundable. Seems deliberately designed to result in minor misclicks leading to unreturnable digital purchases."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Gail Corum", "rating": 5, "content": "Reading with Kindle is perfect for me especially with my devotional reading in the mornings and throughout the day. The best part is Kindle does not need WIFI to operate so you can read anytime and anywhere. Books on Kindle are also discounted, so if on a budget, purchasing power is increased. Kindle is quick, it's easy and it holds your access to many books in one place on one device. My Kindle library is full of my favorite books to enjoy at my leisure."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Angel Rumans", "rating": 2, "content": "I've used various Kindles and kindle apps for years. On my Motorola G stylus, I recently incurred an issue. I listen to the narration of books during the day at work. I pause and unpause using my earbuds. Now all of a sudden, the book will close and I have to reopen the app, relaunch the book, and it loses the place by sometimes several pages. I updated the app and nothing helped. Please fix this!"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Sil Shin", "rating": 5, "content": "Amazon's Kindle is a great way to save the environment, by cutting down on paper printing of books. It's also a lightweight alternative to carrying otherwise a ton-load of books around on your time off, that you're dying to catch up on your reading with. I highly recommend this Kindle app to any avid readers as a way to gain access to the world of books, electronically. In some parts of the world, libraries are uncommon, inaccessible to many. Well, a Kindle allows access to millions of books."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Rebecca Bowen", "rating": 3, "content": "Updated my review at bottom of page. I love kindle I use both the audio books and normal books all the time. Sometimes there are glitches in the audio and there are times it doesn't download. Overall it's definitely worth using especially if you are an avid reader. Not impressed with the last updates gone from 5 stars to 3 if they're lucky. Audiobooks are on a continuous download error loop. So disappointing and very frustrating."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Bob Romberger", "rating": 3, "content": "Changes I'd like to see. Ability to lock text point size of type, it seems to change on it's own. Highlighter is good. But, should also have green. Personal preference, highlights of different colors mean different reasons for the markup. Time at the top is great, but should also have device power level on the right/top."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Nonthanee Noosri-Bérubé", "rating": 2, "content": "UPDATE: Please fix, problems are still happening!!! After the last update I keep getting over 100 blank kindle book icons in my uncollected folder, as well as all of my other collections disappearing. I'll remove them, to have them again when I reopen the app. In order to get my missing book collections I have to close and reopen the app, which I sometimes have to do several times a day. It's extremely frustrating, please fix. Update: 2 - Please fix!! Same problem as above!!"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Telea Hall", "rating": 2, "content": "What the heck! My app keeps showing up with books that were returned years ago, and books that I keep trying to dismiss. I don't know how many times I've tried to delete permanently the same four books, every. Single. time. I open my app. I've been on this app for a really long time and this is the first time I've had this issue. For God's sake Kindle fix it. It's driving me batty."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "H. Mad", "rating": 3, "content": "WILL CHANGE REVIEW AFTER ISSUES RESOLVED. Hi. I've loved the app for Years! But, it hasn't synced since January 2021. I downloaded the beta and installed this app on other devices but I still have hundreds of saved articles stuck in the main app on my android phone. I Googled around for fixes but found none. I couldn't find the feedback button in settings either. HELP!"},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Docteur VanGolan", "rating": 4, "content": "In the In-App setting there's \"Reading list syncing\" for syncing across device. How does it work? Realtime syncing?! I don't think so, since when I read w/ handheld at work, and when I check my tab at home, there's no realtime syncing. The syncing (swap down the list) doesn't work, I must log out and log in again. The worst it download older articles so it double up and up. Suggestion : please make it like a realtime syncing,and perhaps a note which device that original save the article's list."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Allen Nelson", "rating": 5, "content": "I have something really cool to show you. It's the Wikipedia app, an app for viewing Wikipedia on a smartphone. It inexpensively and reliably brings the pro-establishment wonders of Wikipedia directly to your phone any time you have an Internet connection."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Alberto Bollo", "rating": 5, "content": "Simply one of the most indispensable apps on your phone, offline reading, night mode, sync, popular articles and inside Wikipedia entries, love the index, keep it up!!!! 🙌"},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Mik Scheper", "rating": 2, "content": "Has some serious usability issues. The main problem is the way tables are rendered on a small screen: they're very difficult to scroll horizontally and the rows cannot be sorted by column. Also, when editing an article, this app trashes edits, without warning, if a browser or other app loads another article. Finally, the inability to pinch zoom images drives me bananas."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Jay Beland", "rating": 3, "content": "Needs major bug fix. After a previous update, in dark mode it sometimes shows math latex in a search result. To view as dark mode you have to turn off dark mode and invert color, which is inconvenient at best."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Joe Miller", "rating": 4, "content": "Use this a lot, but seriously, why is there not the ability to simply copy the link to an article? This should be a basic function. It gets really tiring having to share the link to notepad, then copy it from there."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Josef H.", "rating": 2, "content": "I don't understand why the hyperlinks have to be DARK blue in colour. It's practically unreadable in the dark mode, where, of course, the background is also DARK."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Kuber Aseh", "rating": 2, "content": "The bottom toolbar is literally soooo annoying in reading focus mode. It pops up every time, really wish there was an option to hide it."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Jonathan Collard", "rating": 3, "content": "Why do some pages not show recent edits im the app? If I use the \"view in browser\" link I see all the changes, but in the app certain pages just dont update despite clearing the apps cache. Not all pages."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "learoy Stewart", "rating": 4, "content": "Terminology of terms wrote are en-in-conclusive to, have completed word's which in the Oxford dictionary making it seemingly positive to negative too comprehend, all explained written writing to get to, terms-with. Today's writing and txt."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Antonio Braganca Martins", "rating": 1, "content": "The app is very good and I just gave one star to call developers attention, but I'll return 5 stars: the app don't show link to Google TRANSLATE option when we select a text or part of text like in early days!"},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Be Happy", "rating": 5, "content": "Stunning app, it does Wikipedia justice. Well done. I use Wikipedia daily. So this app really suits my needs. Thankyou so much Absolutely love dark mode. It's always on. Gives me a relief from eye strain"},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Bungle Joy", "rating": 4, "content": "Brilliant loving it for my virtual bucket list I've been doing explored where in world wreck and cave diving sites are all highest peaks in all of America and Canada not that I will get to go to these countries but it's nice to look at"},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Prasanth Ariyannur", "rating": 2, "content": "I use this app as a default ebook reader. Many a time, importing books take a lot of time, displays \"processing\". Most of the time, when I cancel it and import again, it might go well. Sometimes I had to abort the import and don't do it. Sometimes the alignment might not be good for imported books. Seems like the app needs more work on fixing bugs. Nice concept, though. Hope these would be fixed soon."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "John Burr", "rating": 4, "content": "I use the Kindle app on my phone, and always have a book on the go that I'm reading. However, it'd be nice if it didn't restrict me to just one, and it was possible to organise my library. But though far from perfect, Kindle's convenience and availability puts it ahead of other formats I've tried. Much as I prefer reading a paper book, this is so convenient and, cheapskate that I am, now have hundreds of free books downloaded from Bookbub. My only misgiving is that this probably costs Bezos nothing!"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Tommaso Croce", "rating": 2, "content": "The app insists the user must be connected to a WIFI network for large downloads, and there's no obvious way of changing this setting (even configuring the app as \"Mobile data only\" in the os network settings doesn't make any difference). It's 2022 and a lot of people like me have 5G phones with unlimited data plans, such a restriction is extremely annoying and obsolete"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Troll Bait", "rating": 1, "content": "Great app until they left a complete sped in charge of a random redesign. Who needs sub categories and filters when navigating a virtual library anyway? Good luck finding your way around this heap of poorly curated garbage if you don't already know the title you are interested in or like to have your books chosen for you through an algorithm. Oh, and they removed all of the audible narations included with plus and want to over charge us a minimum of $3.50 per book to add them back. Because $$"},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Evan Martine", "rating": 4, "content": "It's a book reading app. The GUI is kinda clunky at times and it could improve by using a search feature for college student trying to navigate to a specific section or term. Other than that I love the ability to switch from typical page format to an endless scroller. It's easier to get lost in the sause when you dont constantly have to flip pages imo."},
{"app_name": "Amazon Kindle - eBooks & more", "app_category": "Books & Reference", "app_installs": "2,373,556", "user_name": "Sir Karma", "rating": 2, "content": "I like every aspect of reading digital books on Kindle except one so far. I read a lot of books for knowledge and there aren't many pictures but when they do they are usually graphs and detailed illustrations and the quality of pictures on every book on Kindle is extremely disappointing to the point I will have to Google the picture or even purchase a physical copy of a book just to read text or see details in illustrations."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Mike Pawlik", "rating": 3, "content": "Good app, and could be better than Google translate, but we need a \"quick flip\" button to go back and forth between languages easily. Let's not pretend that any app is perfect, so we need to be able to quickly switch back and forth just to always double check. 2 stars taken off for lack of the quick swap button."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Bhaskar", "rating": 5, "content": "Excellent app! Lives up to the reputation, and is a smooth experience for mobile editing and reading!"},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Philippe Negrel-jerzy", "rating": 4, "content": "Formulas aren't visible in dark theme, please fix that. Apart from this, great app overall."},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Urs Stafford", "rating": 2, "content": "It's alright when it works, but half the time when I open the app, it decides that I'm offline, even when I have both wireless and phone coverage!"},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Danie Bohol", "rating": 5, "content": "I give five stars because this app is more fun and beautiful you learn everything that happened in our country and many others:) thank you very much!!!"},
{"app_name": "Wikipedia", "app_category": "Books & Reference", "app_installs": "674,827", "user_name": "Varun Patel", "rating": 1, "content": "The update or some bug has resulted in the navigation pane losing all its content."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Faiz Sheikh", "rating": 5, "content": "Amazing app, best for reading books. Love the ad free experience. I have 2 suggestions for you: 1. Please introduce the statistics feature like how much i have read , my reading speed, time spent, etc as it will keep me motivated and encourage me to read more and more. 2. Is there any way that i can keep specific font and font size for specific books? Currently when i change the font size or the font, it changes for all the books."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Arpita Dutta Koomar", "rating": 2, "content": "I have been using this app since last one year. On and off, story links from Facebook doesn't open at all or takes too long to open which kills the interest altogether. I tried updating the app, but no changes. It is a good app otherwise bringing on board countless indie writers together and giving a chance to readers like me to spend quality time reading, but if stories cannot be viewed, what is the point?"},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Archana Kamble", "rating": 5, "content": "That's really a wonderful app. Only the thing, the read books still appear in the main list of books with those not started, and also in the list of finished books, with download option. This causes confusion between read and unread books in the list. Also, the read book gets downloaded every single time when it gets clicked unintentionally. So the books need to be sorted out completely according to categories: not started, in progress and finished to avoid further confusion. Thanks."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Hrishikesh Upadhyay", "rating": 3, "content": "So far it is good, can be improved more, like the dictionary can be made more efficient. Also please add the animation to turn the page diagonally not just right to left or vice versa. Whenever I download the sample of any book it redirects me to first page of that book, It should give an option to read the Book right away or move ahead with the current book I am reading. We need a good desktop app as well not a third party app."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Omkar Sawardekar", "rating": 5, "content": "Good app for all the book lovers. We can download any book online to read it offline from the Play store. There is availability of auto-read with a clear voice in any language. Also we can download English dictionary to find out the meaning of the words which we are not aware of, which it-turn increases our English knowlegde. I liked the page-turning effect which feels like real-book reading. It is also available in dark mode. Great user-interface. Great work team!"},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "15 Divyansh Raghuwanshi", "rating": 3, "content": "It is really one of my most favorite apps, it's simple and that works for me. I am having an issue with the built-in dictionary,notes and bookmarks. Sometimes the dictionary doesn't work even using with an internet connection, notes and bookmarks of some of my books are removed automatically too ! I made notes for my exams but i think now i have to go through the whole book again."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Alexander Hamilton", "rating": 1, "content": "it's excellent really, just some tiny features would improve it a lot for me -- please add a feature for finer control of font size and if possible, although this is not necessary, it would be nice to have more choices for font and page/text colour. another thing i would love to have is the ability to search through notes. and improve the translate feature, it doesn't work consistently. but all these are superfluous -- please please just add finer control of font size and i'll be a happy girl."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Tejas Shah", "rating": 3, "content": "I like this app quite a lot, but there's a huge difference in the user experience when using this on an Android vs using Play books on a computer. For instance, there's a feature on the browser that lets you make shelves and organize your book collection according to your wishes. But this feature is missing on the Android app. This has probably been the most asked for feature for this product. Not to mention how the UI feels quite polished on the app vs a more clunky UI for the browser version."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Jez Morax", "rating": 4, "content": "This is such an amazing application. I've been using it for years. The developers done a terrific job to make this app standout from other ebook platforms. But the only one suggestion that I have is, if you could include the pronunciation feature when you long press a word, then it would be so helpful for the readers. Especially for a person like me who is not a native English speaker."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Rachana Gugale", "rating": 3, "content": "The app's layout is good but the inbuilt dictionary is really frustrating. It stops working out-of-the-blue without any reason. And then doesn't work even after restarting the app, phone or re-downloading the dictionary. Then after a few days, it again starts working out-of-the-blue. Very frustrating."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Sabita Devi", "rating": 5, "content": "Unlike amazon audible it's audiobook sample is longer in duration and you can easily go forward or backward in the sample,which in turn provides a better understanding about the book and helps in better decision making whether you should buy the book or not.Also books are cheaper here than in other apps because of offers. Really good job by GOOGLE.Thanks for making the world accessible to all.(A small thing only, The voice in audiobook should be slightly louder to make it the best in every way.)"},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Anurag Kumar Shukla", "rating": 3, "content": "It would have been better if there are more customizations that can be done on the reading experience such as various background colors (instead of measely three choices). Also it does not run in full screen in the Mobile phones that have a notch(be it drop or wide notch). There should also be customiztions such as the ability to change text color. The chapter number should be present on the full screen."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "gian z", "rating": 3, "content": "Very happy that there's no ads but if there are ads I didn't even notice it. I love it! The only thing that I hate is the search function. The search is so saturated that I had to check the publisher on the official site website to find the other books that they have. I suggest that you add more search functions, and also like in the play store to be able to see the publisher's books that is available in the playstore."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "U E", "rating": 5, "content": "So far the best translator software I have ever come across. Both the app and on the web. Since we in my family and team are from different nations we speak a lot of languages, we have the possibility to evaluate the correctness of even complicated texts in several different contexts. DeepL do not only translate it is mostly correct in the contextual, subject and cultural translation. I would like to have the option to use the camera to translate day to day text to really ease my life."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Jossi", "rating": 5, "content": "Best app for translating anything, from webpages to reviews. Have been using DeepL for probably more than a year now, mainly as a help with schoolwork and translating different sources into English or Finnish. I find the translation to be nearly flawless most of the time, also really like the option to switch certain words in the text to other synonyms. Also I've never seen any ads in the app, which is one of the features I really love. I really enjoy it, and would recommend to anyone."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "The Mortal", "rating": 5, "content": "Amazingly accurate from all the testing I have done thus far. I've done the best I could thinking up euphemisms and odd speech patterns that usually end up confusing most other translation software, and I have to say, by far, this is the best software I have ever seen with the ability to accurately interpret and translate in natural and coherent sentences. Loving to see where this will go in the future and deeply hoping for some sort of keyboard implementation."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "PlayTime Play", "rating": 4, "content": "The translating service is quite good, seemingly better than Google's. It has the same translating service as the web and desktop versions, but as of writing this, it is a bit of an early version (1.0.1 right now) and doesn't have some features the other versions have. It does have a paste button which is useful though. This version is good for a quick translation if you don't need the other features right now."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Hayder Alsaad", "rating": 2, "content": "I usually use DeepL a lot on my desktop and was excited to find out that there is an app for Android phones too. But I was deeply disappointed to see that one of most features of DeepL is not available on the app, namely the ability to change certain words in the translated text. The DeepL website allows the user to click on words to show translation alternatives which I find very helpful when translating English texts into German. I hope that this feature will be integrated into the app too."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Philip Schimmelpfennig", "rating": 4, "content": "Sadly not as usable as the web/desktop versions. There's no option to get alternative translations by tapping the result and the UI is very minimal. I was hoping for a replacement of the awful Google Translator app, but as of right now this isn't it. With this being v1.0.1 I'm hopeful for more features and options in the future (and the developer's comments seem to indicate this)."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Matteo Parri", "rating": 2, "content": "Most accurate translation engine out there, but the app.. is not finished. · All the powerful features of the website version are entirely missing (can't choose synonyms, can't rephrase, can't see definitions). · The interface looks awfully dated, like it came out during Android's early days and has never been updated since. · This is just one step away from using the mobile browser version of the website."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Lauren M", "rating": 4, "content": "Would the developers consider a button function which allows me to quickly switch between the input language and the output language (E.G. Spanish to English and visa-versa). The functionality of the menu is a bit arduous when compared to Google translate. Furthermore, please could Brazilian português be an option in both menus? Other than that, the app 'does what it says in the tin' and delivers excellent translation 👌 Thanks!"},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "CadmarLegend", "rating": 5, "content": "This is an amazing translator which picks up on all those pesky nuances that languages have. I have had the best experience with Japanese... a language that Google Translate completely flops on. It is truly an incredible, incredible translator. I would recommend this to ANYONE! And the best part? It is free. There is the premium options but you can make due with the free version for hobbies or such."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Mma Pinky", "rating": 4, "content": "Good and intuitive translation. What's missing is a 1 tap \"from-to\" button. I'm translating between English and French and if I want to go French to English, it's annoying to me to need to go so deep in to make that switch. It's much easier to open a different app"},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Steve Benfey", "rating": 5, "content": "Absolute best translation app ever. I speak and read and write Japanese as well as English and a few other languages and I can tell you that this is fabulous. Plus, when translating into English you can choose from multiple renderings of the source text. DeepL is so good, it doesn't even feel like machine translation. It isn't perfect. If you do not know the source and target languages, you cannot be sure that the translation is correct."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "RapidzDE", "rating": 3, "content": "Great App, use it already on desktop a lot, but the app is kinda... disappointing? I haven't found a right word for it right now. I miss some of the features and the UI is what I call, Okay. But hey, it's accurate and it works for normal text, so that's good already. I will look forward for the next updates and see, when I can finally give it a 5 Star, because the Dektop-Version already has a 5 Star from my side of perspective."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Rodvic Diaz", "rating": 5, "content": "I'm giving it 5 stars at the premise that DeepL greatly increased the understanding between me and a friend who couldn't speak English properly (at one point he even thought I was a native), though it lacks some of the other web version features, it's still incredibly helpful. Can't wait for this app to progress."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Oksana Zotova", "rating": 4, "content": "Love your desktop service. Also waiting for more options to appear to select words to translate. Yet, it's very difficult to type in the app, especially if you need to erase, correct something or put the cursor in a certain place."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Abhinav Upadhyay", "rating": 5, "content": "This is certainly the best app that suits my requirements. Since I am a voracious reader and I read multiple books simultaneously this app always opens the undergoing books exactly from the same page I left it. The interface is user-friendly and most importantly you are not forced to see random Ads which makes it the best."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Divyanshi Bhandari", "rating": 5, "content": "This is definitely the best reading app I have ever used. I am able to organize my files into different folders, add authors for the books to make them easier to search, edit the title and make it different from my file name and loads of features I adore so much. This is the perfect app for reading!"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Suryansh Mittal", "rating": 5, "content": "Awesome app, i wish I could give you 3000 stars. I finished reading a whole book from it, and I am not much of a bookworm though. The mode of flipping page horizontally makes reading the book more fun. It's fun to use bookmark, and the one thing which i absolutely love about this is, that they can save your page history, an you can clear it as well, so if I didn't just put a bookmark i can still go to the right page. Awesome work developers. Cheers ✌️"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Mudra", "rating": 5, "content": "Excellent app. I am so glad I found this. I've been using it for an unethical purpose though; that is, looking for answers during my online exams. This app's search tool is several times faster than any Microsoft or pdf reader and saves so much time! Moreover, I often don't even have to open the page itself; the search tool gives me a preview of all the lines containing the keyword so this is another way how my life has become much more convenient. I've recommended it to my friends as well."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Neelam Singh", "rating": 5, "content": "This app is brilliantly designed. Even without purchasing its premium membership, I am extremely comfortable with its usage. There is no ads which is a pro. The app is user friendly and is compatible with all kinds of files (.epub , .pdf , .mobi). If you are looking for an offline e-book reader, this app is just a click away from being installed."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Bhushan Mhatre", "rating": 5, "content": "Suggestion: Would appreciate a feature which would allow us to increase the font size, maybe that would require parsing the page and presenting in simplified format, the way chrome does on webpage, that will also allow changing font family. Maybe it would be expensive feature. Otherwise Simple and easy to use app which bookmarks the last read page also dark n other modes available."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "KjiMjiSs", "rating": 5, "content": "1. I use this fantastic app for reading the pdfs of different genre of books as it has various option to sort them and form your own kind of clean and clutter free library. 2. This app has amazing interface and all the tools that will enhance your reading are present. Such a delight to read, underline, save, bookmark and what not! 3. It works without internet and ads free experience. As an avid reader, I have tried almost all the apps on playstore and found it best. ❤️ for it's developer."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Debashree Bose Mukherjee", "rating": 5, "content": "A Great app for reading. It allows you to open any reading extension and offers good quality. There are multiple other options which allows you to change the font, size, etc, for free! Also there are No Ads at all. The closest thing it has to an ad is a popup for a ReadEra Pro which allows even better experience. You can also categorise all of your books. This is the best app in the store!"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Ayush Chaudhari", "rating": 5, "content": "Amazing! You can customize it a LOT to your liking. I used to use Lithium, but all the good stuff in it was behind a paywall, so I downloaded all the other apps and ended with this! One problem is there are two flipping tabs: vertical and horizontal, which have the same options and I still don't understand the difference. Also, could you add an option that switchs the flipping buttons, i.e., tapping upper corner flips the page forward and not backward and vice versa. Solid app, still!"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Dan Designs", "rating": 5, "content": "Amazing, it's completely free AND opens almost all formats! But: 1. I wish I could search in text without having to wait for the book to load itself, 2. Search in-text for books only in a certain collection/series/by a certain author etc. would be really useful. 3. Sub-collections would be useful, collections in a main collection. 4. Being able to change covers. 5. Batch-editing. 6.This app would be so useful on windows, it would be even better than adobe's reader! It already is on mobiles!"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Nityam Gandhi", "rating": 5, "content": "I have been using this app for a month now and I'm enjoying it so far. ReadEra makes it easy to organise and keep a track of my books. The GUI of the app is minimal yet offers a variety of features and fulfils the demands of almost every e-reader out there. However, it would be great if ReadEra adds a blue light filter within their app itself that turns on only when someone wants to read. Otherwise, it's a great app to give you kindle like experience on android."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "S Singh", "rating": 5, "content": "Hello, I really like your app. I have a request please. Can a feature like this be implemented in the app through which we can use different settings for each file? For example, the ability to set attributes like page margin, orientation, and all such settings or maybe all the in-file settings individually for each file. Plus maybe an option to this feature on or off from General Settings as per required by each user. It is really a hassle to change these settings for multiple documents. Thanks"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Shaikh Sama", "rating": 5, "content": "This the best app I've used for ebooks so far. The best part is the page history, u can easily catch up where you left. Something that I would suggest the developers to add would be to allow users to create an account on ReadEra so that even if we change our device we can still be able to access our previous documents, bookmarks and the quotes. And also probably get different highlighting colors This would be a game changer ! Cheers !"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Roudranil Das", "rating": 4, "content": "This app does exactly what it says. Allows you to open files of all formats beautifully. However, i would rate it 4 stars, since if we could use the pinch-zoom feature while reading pdf's it would be even more useful, and eye-friendly. Moreover, rotating the screen does not actually increase the font size. I would like these two issues to be looked into. Otherwise an extremely efficient application."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Souvik Datta", "rating": 2, "content": "Team Pratilipi, I love this application. For free we can read many many amazing stories or listen to them in multiple languages. I have one complaint though, suppose I choose a certain genre and filter the stories by \"Short Contents\" even then long stories/novellas having mutiple parts are getting filtered. Previously this wasn't the case and short stories with used to be filtered out. Please fix this issue. Thank you"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Karthika Velliangiri", "rating": 5, "content": "This s a lovely App to all who loves to read. But one major drawback is if the novels were posted in episodes , it would be easier if there is link for the next episode at the end. Also no notification is appearing in the app when the episodes are appended to the existing content. It would be really great if the notification appears whenever the writer modifies/add the content of the story."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Abhijeet Umbarkar", "rating": 3, "content": "Congratulations!!👏 You provide a good platform for young talented author to showcase their stories. However their are still some glitches whenever I update the app. Takes a little more time to load. Some of my collections are missing. I installed this app on my old device and new device. On both devices, I use my same account to login, however stories saved on my old device are still missing. Some stories are still pending from atleast an year. Hope you guys will work on it. Thank you 👍"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "ruchika malik", "rating": 4, "content": "This app is not working for last two days. My phone's network is working properly but when I open this, showing something went wrong or not able to complete this work right now. I am using this application for last 6-7 months, this is excellent platform for writers and readers also. But some writers post stories or their parts after long duration and readers face problem. Please adjust for this problem."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Sunsmile", "rating": 5, "content": "App is awesome. I have been a user from past a month and I had no issues but from recent some days I am finding a problem. It takes a lot of time to open though I have good network. Even my works don't open. I even reinstalled the app but it still has problems. I can't use it so could u pls look into it ASAP because it's very difficult to use it."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Soumyadeep Das", "rating": 5, "content": "Very good platform for writing and reading stories, poems etc. But from the last update I am facing an issue of this app. While reading someone's content, when I leave from that, it returns me directly to the home page. I lost my last progress and have to go to the content again. This is very irritating, please fix this. Otherwise everything is perfect. Thank You."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Suresh", "rating": 3, "content": "Using the app for nearly 2 weeks. The app UI is nice & easy to choose contents. Swiping gesture for turning pages, continuing the content from where you left, keeping the screen ON etc. gave me a pleasant reading experience. What i missed is, lack of contents from lengendary writers of Tamil language. I find Most of the contents are from new amateur writers. Though few of them write above average, i think the app should provide a choice for the readers to explore top rated legendary contents."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Gaurav Bhatnagar", "rating": 3, "content": "App is too good and concept behind app is example to other. However there seems to be some functional requirements. First, I did not find any option to go to home page. Every time I have press back button and it take all stories which I already saw. Second I did not find any option to distinguish between already read stories and chapter. Developer can you please see if you can do something in this area ?"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Arunnandhakumar Sundaresan", "rating": 4, "content": "Good app. Very good stories. Missing a feature, when there are 10 chapters, and we have read 2 chapters, there is no way to identify unread chapters. Also, while reading chapters continuously, back button goes to previous chapter. There should be an option to go to home page of the article"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Pranali Patil", "rating": 5, "content": "The features which I loved 1. It has a variety of languages. So u can always find good stories in your native language. 2. So many stories. I mean literally, there are so many stories that u won't get bored. To the avid reader, it's a treasure trove. 3. Contest. Pratilipi always introduces a new contest every month. Also, u get a certificate and prize money if u win. 4. Large supportive community. Nope, pratilipi don't encourage negative comments and it's a rare chance that u come across one."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Deepti Ranadive", "rating": 1, "content": "good app with loads of technical glitches which are very common. app takes ages to load main page, only one content can be chosen at a time, app language selected is english it displays regional language. Chat messages do not open, no facility of replying to specific chat message, as writer there is no voice typing facility in the app...high time to include this function..."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "uma devi", "rating": 1, "content": "I am a full time writer in this app Recently I have written a biography series my diary contains 92 chapters But to edit I can see only up to 35 chapters Even many discussion topics posted earlier I thought of re posting as a series But it is rather impossible to copy my earlier comments published in discussion topics. Search engine will not work smoothly For typing the next line it will not be visible After publishing we need to edit many times before posting Not a user friendly app"},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Cristian DRAGHICI", "rating": 5, "content": "I used it for more than fourteen years and it worked great. My high-speed internet works perfectly, was well. Lately, reading books allowed started taking frequent breaks, mainly if 'more natural voice' is toggled. They are quite annoying as I'm not used to them. I should get what I bought. Put a refresh button or fix it one way or another, I'm sick of downloading several times each book I'm reading..."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "ThinkerTinker Tanker", "rating": 2, "content": "This app is useful, but it could easily be a lot better. What I love is that it saves my notes and highlights to Drive and syncs them across devices. Some things I hate about this app: (1) You can't adjust play speed in the app. (2) No pause, play, or skip buttons on the main screen. You have to use the pull-down menu. (3) You can't highlight something that starts and ends on separate pages. You have to make two separate highlights. (4) It won't read PDF books aloud."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Angelika", "rating": 2, "content": "Okay app if you can tolerate reading on your phone. Wouldn't recommend if you prefer listening to your books instead. I would use it but the text to speech voice is so unnatural it's hard to listen to. Listening to books is much easier for me. I have so many books in my library but I don't use the app bc I can't listen to my books. If the voice options are ever changed I'd use the app but until then I won't really be using it."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "McCheezy", "rating": 2, "content": "I used this for a research report on a biography I was reading and it kept misplacing, deleting, and not syncing my annotations. It was very infuriating to know I highlighted an important passage only for me to check back the next day and not see anything. Very glitchy, ate my phone's battery and all in all a headache. If you're doing anything beyond casual reading I would not recommend."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "James Gillis", "rating": 1, "content": "You cannot change the rest aloud voice for this app even if you change it system wide. The voice that they give, even with the web upgrade selected, is so robotic and unnatural it's cringe. Not being able to listen to books with this app means it's useless. This has been a known problem for years, it's crazy they haven't fixed it yet."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Fabiano Melo", "rating": 4, "content": "It works just well for my needs, but it's not perfect. I use it mostly to read PDFs, so if the double-touch zoom feature could remove only the borders of the document and fit the text to the device's screen area instead of applying 200% zoom like it does now, it would be awesome. Similar to what happens with some web pages when we double-touch the screen (it fits the text to the screen area of the device)."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "yarmari mouton", "rating": 3, "content": "Despite app updates for the last 6 months I have not been able to read the magazines that I have downloaded. After a successful download when I open the pub to read it the pages are buffering....non stop. I have deleted the pub & started over, then I closed the app to \"refresh\". All of my troubleshooting have proved unsuccessful. I even chatted with a Google representative. She told me that it was problem they were working on. I have a Galaxy Tab A7. Six months is a long time!"},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Lauren Hales", "rating": 1, "content": "Laborious and frustrating. I mistakenly purchased an ebook instead of the audiobook, I asked for a refund and it was rejected. The refund process is vague and does not allow a dialogue or a specific reason to be entered, there is no clear way to communicate with anyone and you are sent round and round in circles. The whole experience has left me frustrated and confused. Perhaps Audible is the better option."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Just Some Fan", "rating": 2, "content": "This is my go to app for reading books but recently when I've been trying to read, it keeps skipping around. Like I'll try to do something while I'm reading and it'll just skip through half the book. And then I'll try to go back to where I was and it either takes forever bc I have to manually turn each page or it just goes back to where it skipped to. It's annoying"},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Amanda Delp", "rating": 1, "content": "The app has had significant library syncing / connectivity issues recently (and yes, my internet is great). new library additions don't show up in library, and since I tried deleting data and reloading it, now nothing shows up in my library. I can still read books I've bought by searching for them, but after reading app doesn't remember them. Also, it's super frustrating that search only really includes the store rather than being able to search my library purchases + uploads."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Limeng Chen", "rating": 5, "content": "This is THE MOST accurate translator I ever used. I used it to translate English, German and Chinese. From academic papers to The Guardian articles, it does it's job very well and helped me to learn new vocabularies. It's also free to certain extent, daily use is enough for me personally. Wish you guys a successful future!"},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Vega Gidey", "rating": 3, "content": "No sign-in option for pro account users and I'm a paying subscriber for a reason. Also, can't see alternate translations. Also, the copy and paste function is very limited, and no ability to reverse translation languages. But translations are very good."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Bianca Bella", "rating": 1, "content": "Downloaded the app as I have a Pro account and was hoping I would be able to upload a document and translate it. Sadly not the case. So this rating is for the app only, not Deepl itself. It is much faster for me to open the web browser on my phone than to open the app."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Andre Ehrlich", "rating": 5, "content": "The DeepL translation is by far the best i can find for Modern Greek - English! I find the quality to be very high. I'm really happy the made an app, so that i can use the service more easily. Feature request: maintain history of queries"},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Anthony", "rating": 5, "content": "I have been using this for well over a year now. Since I started to learn Spanish this app has not only saved me in instances where there's a language Problem but it has aided me in learning new Vocabulary and Sentence structure. Amazing app, much better than Google Translate. So accurate"},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "yeagmatic", "rating": 4, "content": "Really like it so far. My only problem with it is that it doesnt show the pronunciation of the language im translating from in roman letters, which Google Translate does have. It that gets added, I'll never have to touch Google again."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Andrew M", "rating": 1, "content": "Unfortunately, does not provide furigana when translating to Japanese, only kanji without pronunciation. Opening \"settings\" only shows legal disclaimers, etc. There are no actual settings options. Much greater functionality in Japanese Dictionary Takoboto or Google Translate."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Iana Chiapco", "rating": 5, "content": "I absolutely love this app since I am actually using its desktop version. My main suggestion about adding languages, which are Norwegian, Icelandic, Latin, and Esperanto. If you add those four languages, it could my method to learn a language."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Venetia Bloomfield", "rating": 3, "content": "Translates more accurately than Google translate which often changes whole meaning of a sentence. However, a few times on my mobile, when trying to translate a quick message to send to Italian family & friends I get this message. Why & what does it mean? 'Sorry we couldn't translate your text. It appears your network is sending too many requests to our servers.' I wait a while then try again with my short message & get same note. Very frustrating when I need to do a quick answer."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Siddarth Varma Bhupathiraju", "rating": 5, "content": "You can rarely find a hassle-free app such as this that is actually good quality and doesn't bombard you with ads or require registration. Supports multiple file formats and has a simple, efficient interface that lets you easily access your books, and separates them according to read status. Bonus: it doesn't put a drain your battery or RAM either."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Haleemath Ath Hara Fuzaila", "rating": 4, "content": "I've always stuck to Moon+ Reader, but decided to test this one out. Nice GUI, and I love the agility. The organizational options are also useful. My only complaint is that it lacks a dictionary option. This was a huge disappointment for me, since I always have to look up unknown words in my preferred offline dictionary. Also, there could be a lighter dark theme option, or at least a facility to decrease the brightness beyond zero. Loved the app, but switching back to Moon+ for now."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Komal D'Souza", "rating": 5, "content": "Really awesome app which can open various formats, and has loads of great features! I'd love to take the premium version sometime. It would be great if there was a sign in or auto-sync (Google Drive) option though. (I think there is some option for it, but I'm not sure) Ever since I have installed this app, I have created many folders and notes on it, so I don't want it to be lost, so the concern."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Shri Aakash", "rating": 5, "content": "This app is amazing. It lets you read books of various extensions without having to convert them to the regular formats. It also allows you to create shelves and collections within the app for ease of access of similar books. One of the best features is the mode of reading where we can choose either dark or sepia or normal and other modes. The best part is the app doesn't have any ads and is light on the phone"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Neel Bora", "rating": 3, "content": "This is one of the best app. But please add my these two suggestions- 1> Add an option to search a text in a specific part of a book instead of searching in the whole book. Because it takes a lot time while searching a text in the whole book. 2> Add an option to double tap zooming. Because it's very difficult to use two finger for zooming while reading by taking the phone in one hand. Then it will be the best reader in the play store. And i'll give u 5☆."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Ishani Ahmed Saikia", "rating": 5, "content": "This app has great features that helped aid my reading experience. The night mode is better than other apps, the brightness adjustment is quick and easy. The progress percentage keeps me motivated. The text/line adjustment options are also great, but i think the size of the letters don't seem to change much. All in all, great experience till now."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Supriya", "rating": 5, "content": "I've tried a lot of reader apps and this is by far the best one! The UI is so cozy and neat that you forget you're reading on a screen and not on paper. It's easy on the eyes somehow and also very minimal and easy to use. Devs, you guys did a brilliant job. Please don't ever change the UI (like some other apps did). This app is perfect, I'll def consider buying the premium too"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Manoj Nag", "rating": 5, "content": "The thing that I like most about the app is that we can keep books in sections like \"to read\", \"have read\", \"reading now\", \"collections\", etc. The books appear in big sized icons with their cover pages that gives a feeling accessing a physical book shelf. The on screen functions like bookmarks, color mode and access to other options are intuitively placed. It's a pleasure to read books on the app!"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Archana Kamble", "rating": 4, "content": "Nice app! Books of all formats are easy to read in one app.. it's worth! It should also arrange some different option (maybe import) to get the books from available sources within the device. So that one can bring the books in the app as per his/her convenience and choice, rather than generating copies of the same books or documents through scanning, and consuming more space unnecessarily.."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "K S", "rating": 5, "content": "If you are looking for a good e-reader without the annoyance of advertisements flashing across every inch of your phone's screen, then this is the app for you. It is fairly easy to add the books and browse them via various categories. Various formatting options also available in the reader for ebook, not so much for PDFs, which is kinda expected. Overall, a nice app, thank you for making this."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Aakif Rasool Bhat 46", "rating": 5, "content": "THE BEST The above two words aptly describe this app. I am someone who constantly has to read one thing or other on their phone, and through the years have tried almost every app you can find on play store. Though some may look attractive at the beginning, their is always something missing, it may be library organization, support of particular file type. But with readera i have not faced any problem in my three year of it's use. It is perfect in its interface and just keeps improving with time."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "sahitya velisetty", "rating": 1, "content": "Full of bugs.. not able to open app . Clear it as soon as possible or need to uninstall .. I have subscription as well. Waste of money. Not opening at all.. Still no change after soo many updates. App is not opening at all."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "annu a", "rating": 3, "content": "Have been using this app for two years now but for past few days the app will is not working and there is too much buffering while loading the content. Please look in the issue. Thank you"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "cherukuri nagalakshmi", "rating": 1, "content": "No doubt it very nice app who keeps reading stories...generally I don't take time to edit my review but now I am doing just because there is continuous notification problem. I felt so worst about it because we step in to pratilipi to get some relaxation but now there is no such way it seems...I faced notification problem for so many times within a very short span of time...please work on this and try to never repeat it"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Amanpreet Singh", "rating": 5, "content": "It is the only app in india which is thinking about writers. It is the only platform that is trying to bring opportunities for a writer to earn. If it succeeds in providing a writer with sufficient income then this app will be the best app in India. Then we can say becoming a writer is also a career. It must become a career in India too like in foreign countries. Otherwise there will be no one in India creating new thoughts. No new thoughts means no progress in society."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Madhuraa SP", "rating": 3, "content": "App is very good for new writers and also for readers.. but I am giving 3 stars because there are lot of complaints about copy of stories of writer and paste it by own name.. is this good.. writer always take lot of efforts to write story, write by dedication but there is no any action taken by you.. please do something for this . Otherwise all writers will never use this app for story writing.. kindly look into the matter."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "fehmina khan", "rating": 1, "content": "I'm using this app since 3 years it was good but now it's getting worse day by day. When ever I open the next part or story it just keeps on buffering ,Pathetic. I can't read stories as part by part at one time ,everytime I have to reopen the app again & again to read another part which is very irritating.I think this is all because Pritilipi wants us to subscribe their app ? Disgusting 😡😡😡😡😡😡😡😡 If anyone wants subscription then only you download this app otherwise this is irritating."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Ashwini K", "rating": 1, "content": "I have been using pratilipi for sometime now, after recent update the stories are not buffering..need to come out of app and open again to load the stories. Kindly fix the bug. Also the coins are not credited even after completing the reading challenge."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Arun B", "rating": 5, "content": "Amazing app. Huge collection of stories. My favorite feature is instant translation when you long press on any word. That makes reading so much easier. Loved this feature!!!"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "kashmira dabhi", "rating": 5, "content": "I am using this app from last three and half years.. My problem is, that i cant read stories.. If i am ready to pay coins to unlock an episode, then also its not opening.. Why is that so? Its getting worse and worse.. And the subscription thing is just annoying.. Stop this subscription thing.. Thank you for solving my problem.. 5 ⭐"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Athira. K. S", "rating": 5, "content": "Gd experience. It improve reading habit and creativity. And imagination also.but nowadays, some difficulties arises. When i try to read or open some parts of the story then it go back to the home page. What will i do?"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Karthika P V", "rating": 5, "content": "Excellent app. I loved it. But now days iam not able read the entire story, if i read any part, need to change font size to 12 &13 frequently. So not able read the story properly. Please fix that"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Digambar Chaudhari", "rating": 4, "content": "Thank you pratilipi by pushing update, now app works perfectly. Last error: Please, fix scrolling bug, when I scroll the home page app automatically close and again reopen, before updating app it works perfectly but after this update it gives scroll error"},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Niko Faershee", "rating": 1, "content": "Read aloud is terrible after last update. I've used this up daily for years to listen to epubs through the Text to speech function. After the last update, I stopped being able to control the voice settings and it just speaks impossibily slow. I am forced to use the enhanced reading mode but it's unpractical. Changing the phone tts settings doesn't affect the app I've tried to clear and or reinstall everything, but nothing worked. Please help."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "martha john", "rating": 5, "content": "Exellent app!!! Even though not all the books are free, the free books are also exellent. And many books are also at a cheap price; i was so not disappointed! If you are looking for book apps, you've come to the right one!! The features are also pretty cool, simple. Love this app.. ..i use it every day! 😊😊👍👍😎 The only slight downside is that i wish more ebooks would be recommended for me. It's like, 1 book in 2 days. It would be much better if it was maybe 3 or more books a day."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Samuel Luther", "rating": 4, "content": "I actually love reading so much, but I don't like turning pages is it okay if I suggest that Google Play Books should add scrolling reading mode? It's more efficient, and the pages number sometimes distract me, I feel like I'm not doing progress if I keep looking at the pages number. But so far so good this app has been so helpful."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Alex Tolman", "rating": 4, "content": "I have most of my library on Google books. The only thing keeping it from a full 5 starts for me is the fact that there are multiple copies of the same book. As an example, I bought the wheel of time series some years ago. Some of the books are from one series, some are from another. There isn't any difference in the books, but they show up as separate series, and shows my series as incomplete, which then in turn messes with the recommendations."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Elizabeth Rogers", "rating": 5, "content": "Best most straightforward reading app on the web!!!🙂 Finished books are purchased for one low price. Then you can binge read or finish at your leisure. Other apps suck you in then charge per chapter such as BRAVONOVEL which costs an average of $500.00 to $700.00 to finish a book. I know this from first hand experience. It is an average of $20.00 for 100 chapters and it adds up when there are 3379 chapters. I quit that app after spending $60.00 plus tax and still had 3079 chapters to go."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Crystal Ptacek", "rating": 3, "content": "It's good app just needs some tweaks, one make it so that if you upload books it tells you the ones you already uploaded and let's you choose whether or not to download them again. If the book doesn't upload properly save the notification, so I can go back and try to upload the book another way. Also I should be able to change the name of the book if I am the one uploading it."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Jeff Greenert", "rating": 1, "content": "Worst books app EVER! I will never buy a book from Google again. App cannot keep track of your spot in ebooks and stops with audio book playback every few minutes. It once was great but Google has destroyed the basuc functionality. I have to bookmark every time I stop with an ebook and constantly have to keep waking my phone to continue audio book playback. As a user of many Google apps, I have unfortunately come to realize that Google doesn't care about users and their app experience."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Marcond Marchi", "rating": 2, "content": "Allows you to upload articles and books you've purchased in PDF. However, it's not good for academic research, because when reading the uploaded PDF texts, it doesn't allow you to highlight or copy any part of the texts. Only simple bookmarks."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Zulfalhie Mohamad", "rating": 3, "content": "The enriching reading experience is turned down by the absence of a good-looking library (a bookshelf-like display would be very much pleasing) ... And the ability to jump straight away to a specific page... If play books is to be a versatile app for studying then this feature is a must."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Pixel The Walking Databank", "rating": 3, "content": "This used to be amazing for studying because I could bookmark my spot where I want to take notes later. But now when I make a bookmark the white popup with the option to undo never goes away. 20 mins later it's still there. Tapping other parts of the screen doesn't fix it. Why would this be a change we needed?"},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Damian G.", "rating": 5, "content": "DeepL is an invaluable resource that I've been using in my browser for years now. It was always inconvenient to have to go to bookmarks or navigate through tabs to get to it, so having a dedicated app right in my apps drawer helps tremendously. This is a great app and DeepL is easily the best translator out there."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Diego F.", "rating": 4, "content": "It's the best translation app I've tried, and I also use deepl on Windows. Only that there is a function that I have done in lack to completely replace Google Translate, and that is that deepl can work offline, and also a floating icon to translate from anywhere, like Google Translate"},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Mik", "rating": 5, "content": "Probably the best translator app you could use, it's even useful even when I'm fluent on some languages. I strongly recommend this app. It still has room for improvement, the website and app, but overall for the languages available to translate its really good."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Michael Garbe", "rating": 5, "content": "Great translator! It gets improved over time too, so a welcome alternative to the ones from Microsoft or Google, an alternative I prefer by a lot. The voice output sounds a bit funny, though."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Cornel M", "rating": 1, "content": "I really love DeepL. But this app is useless. The desktop version allows you to change words in translation. However, thisone does not. So if you need to translate from english into a language that uses genders, or if you want to use informal \"you\" you are better of using a diferent app."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "J J", "rating": 1, "content": "Didn't work at all - the output text is exactly the same as the input every time. Using Samsung s20 ultra - please let me know how best to fix this. I'll update this review score! You want to see why it fails? Try doing detect language and translating \"hola\" or \"konnichiwa\"."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Domenik Wagner", "rating": 5, "content": "Endlich gibt es euch als App. Ich nutze die Webseite schon seit 2019 als Standard übersetzter. Auch meine Webseite ist mit Deepl erstellt worden und es gab nie Probleme. Ich bin sehr zufrieden. Besser als alle anderen übersetzter. - Finally you guys are available as an app. I've been using the website as a default translator since 2019. My website is also made with Deepl and never had any problems. I am very satisfied. Better than any other translator."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Ihh Kuuu", "rating": 5, "content": "Life pro tip: use DeepL instead of Google Translate! The translation are very accurate and take finesses of the translated language into consideration. The app is as awesome as the desktop version! THANK YOU SO MUCH! Waited for this to come for a while!"},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Rin Morningstar", "rating": 5, "content": "accurate, fast, even has a dark mode, but the language set is very small. I look forward to seeing its capabilities expand"},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Random Dude", "rating": 4, "content": "Finally! It's very basic but I don't mind that. The only thing I'm missing is the ability to use this as my default translation app. I hope this is doable and not a limitation on android (if that's the case, sad, but please tell me so I can adjust my rating... Don't want to punish apps for not doing the impossible)"},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Doriel미샤", "rating": 4, "content": "It's pretty accurate when i translate per paragraph, but when i translate the whole thing, the grammar is messy and confusing. Wish they could update to better dark mode UI too."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Back Pack", "rating": 3, "content": "The app is good, but the problem is when I let it speak my results, it creates a high pitch, squeaky voice that is almost incomprehensible. I don't know if that just me or anything, but I hope to get a solution for this problem."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Lisa Frank", "rating": 5, "content": "One of the best apps I've come across.No annoying ads. The free mode is good enough so far. For more options you can always go for premium. The coolest things for me about this app was how smoothly it worked on my phone, it would show a list of contents with the page no. So that one can easily access those topics. I've only found this option to not work for one book so far. Maybe coz it wasnt a digital book/ had scanned pages. 1 thing I couldnt figure out was d highlight option mayb isn't free."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Shivangi Goenka", "rating": 5, "content": "The best reading app ever. I read a lotttt, so this is really helpful. It has all the features like night and day mode, font size, line spacing, vertical and horizontal view lock,etc. It has it All. I know i m getting old because the simple feature of 'series' makes me soo excited, its where the books of the same series automatically make a seperate folder and I don't have to make it for each series. Highly recommended."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Zenister", "rating": 5, "content": "Best reading app so far with no annoying ads love your free app initiative. Actually i encountered a bug while reading a specific book i love to read, whenever i select one of the chapters in the contents menu i always get dragged to the first page of the book i don't know why but this only happens with this specific book it'd be a great help if it could be resolved. Otherwise a great app so far, no complaints🙂. Kudos!!"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Tejas Auti", "rating": 5, "content": "An amazing app to read epubs. A very smooth and easy to understand interface. You can create your shelves and reading lists. However, would recommend addition of couple of features: 1. Reading statistics like Reading Speed (words per minute), Word Count, etc. 2. Presently the app doesn't allow removal of single document from reading list (only way is to clear the whole list)"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Avanish a", "rating": 5, "content": "This is one of the best apps for book reading with so many great features. I just loved it. Only thing that is missing in the free version of this app is that you can not highlight a sentence in a color other than grey shade. Only if they had provided option of highlighting sentence atleast in yellow color as in onedrive it would have been the best of the best apps"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Keshav Keshav", "rating": 5, "content": "Plain, Simple. Does what it claims to. One of the very few apps left on playstore that actually cares about the functionality. Design, usability, Navigation.. everything is very straight forward and simple. I've used this app since it was available as beta. Spreading the word about it as much as i can. Thank you for making our reading experience simple, straight and enjoyable. Keep up the good work devs. :-)"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "vikash ramola 29", "rating": 5, "content": "This app is good. It is perfect for reading. Very easy interface. You can make your own collection. But if you can the feature of an dictionary like a tab then it would be nice. The web search option is there but it breaks the flow of reading. Thanks. Edit- thank you so much for adding the dictionary feature."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Debarun Banerjee", "rating": 5, "content": "For a heavy user this work wonders. Clean and simple to use. Opens zip files in app, a neat feature I was not expecting. Multiple window option to open ebooks, so useful when you have to switch between multiple files frequently. No annoying adds. Single tap bookmark and night mode, page scroller and manual page entry. Adding books to personalized collection, although that feature could do with a bit more refining. Oh and did I mention the uncluttered, no nonsense and simple UI?"},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Bhavana Murjani", "rating": 5, "content": "It's a wonderful app. Not only it accepts various formats, it's also completely add free. The font, page mode and colour mode everything can be adjusted to suit my needs. Personally, I loved the sepia colour mode, gave off a real book feeling! Also, all my books are stored and bookmarked which saves me the trouble to search. All in all it gives a amazing reading experience."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "study Mate", "rating": 5, "content": "Easiest way to organize my books & pdfs. Light app doesn't need much storage. I Updated Just now! It's awesome as always. Now it supports dictionary too. But you need to have one installed. Best to go with livio or lookup or both. Pop up dict would've saved the time of goin' back n forth between apps. I Love it. Please never Change it. I feel at home with it & so does everyone else who has it."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Arunima Subramaniyam", "rating": 5, "content": "I had initially only rated the app and not written a review but it really deserves one. It has a nice, clean interface that makes reading various kinds of books and documents very easy and enjoyable. It has a few tiny features that can be improved but then this app is constantly improving. Thank you for this completely amazing app and the effort that goes into updating and improving it while keeping it free."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Dominic Braganza", "rating": 5, "content": "My search for the good reading App ends here. Tried many but ReadEra is by far the best. Brightness slider on the left side makes night reading a real new experience. I would like to add that since the penultimate update the dictionary is Wikipedia by default. This causes much trouble. The present update did say one could select the dictionary but I don't find the option."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "Siddharth Sagar", "rating": 4, "content": "The experience while reading ePub files is great. 1. This is missing while reading pdf versions of books especially while reading in vertical screen. 2. Also, while the full screen mode is selected and navigation bars are removed, please continue showing battery and time. It stops from sliding settings again again to check time and battery. Please do the second one and it's 5 stars."},
{"app_name": "ReadEra - book reader pdf, epub, word", "app_category": "Books & Reference", "app_installs": "847,066", "user_name": "M Salik", "rating": 5, "content": "Love the app, absolutely amazing application. It is very useful and interestingly it doesn't have any ads. Thank you so much ReadEra. I have suggestion, Can you add an option to export all your highlights to 'Notion app' with location of each highlight(ie. If we cleack on the location of a particular highlight in notion, it should take is to the book and exact line where it is highlighted from). Also it would be great if I could store notes online in 'Notion' or 'google drive'. Thank you."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "DIPTI BHAGAT", "rating": 1, "content": "Pratilipi was really good reader aap before pratilipi premium. the coin system you've introduced. it doesn't work properly for pratilipi premium. I tried so many time to unlock next story parts but it doesn't work. stop advertising please buy our premium pack. if I ever need it. I'll definitely buy it. but not like this. It's a great that writers can earn from their writing but please we readers want to enjoy reading as well. please developers keep that in mind too. thank you."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Reji Nasar", "rating": 1, "content": "Its fraud, i tried buying coins, and every time it showed that transaction failed but when i checked my bank balance,for everybtime i tried, cash have been deducted from my account , i tried to write a complaint about it in the app but there is no such options in the app, i never had a worse experience like this before with any apps"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Moonmoon Saha", "rating": 1, "content": "This is too much 😠😠😠😠 I have a advise to the controller of this app , why don't you check your system???? Occasionally there is a problem with it, why don't you check it??? We are suffering man!!! We can't see any part of stories, any updates and nothing. And the biggest problem is I can't see the profile of my favorite writer, not only this also can't find any of her stories and can't message her any more to inform this problem 😡😡. If your system is defaulting then stop this app😠😠😠"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Athira S", "rating": 1, "content": "Day by day it's getting worse. It is all about money. Subscription feature is nice but don't force the readers to pay. Premium feature is not at all good because there are children reading the stories. They have no income to pay. Parents won't allow thwm to waste money for this. I was using the app for 2 years. You just wrote in the description it is a feee app. Just don't say if you don't want to support the readers wait for a day. Reduce the amount. Make it affordable"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Anushka Verma", "rating": 5, "content": "This app have fully changed my life, very nice app. We can read any type of stories which we want at anytime. I love stories a lot from childhood and after finding this app, it became my favourite one. Must download!"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Seshu Kumar", "rating": 5, "content": "It's a very good app, there are lot of stories in respective languages, good relief. One major problem is there are some notification issues."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Supriya Dev", "rating": 1, "content": "The app is not Working and showing error unable to complete action. If I have to wait for unlock each episode for one day than how can I read may parts of that story. Plz remove this subscription part."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Sanvi Saanu", "rating": 5, "content": "Best APP for STORY readers. In offline also we can use this by saving. All stories are good and very intresting."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Sam Ali", "rating": 5, "content": "Pratilipi is one excellent app for stories. Hats off for the hard work and effort. May you keep growing."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Gowri P U", "rating": 4, "content": "It is like a beautiful world . Good stage for both readers and writers , but nowadays some unwanted topics like fanaticism are raising here . Please control that ."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Rajib Dey", "rating": 5, "content": "Amazing app...no disturbance at all just sometimes has a notification and cover photo issue. Other than these, it's a very convinient app for writing, reading and discovering stories!"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "swati kadvadkar", "rating": 5, "content": "Best story app ever I have seen. The stories really touch the heart and sometime by reading the stories even as human being I have feeled the pain of the character. Lots of thanks for such app."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Joey Casas", "rating": 3, "content": "I liked the app a lot. I do both reading and the \"read aloud\". But after the latest update the \"read aloud\" is now too fast, and nowhere can I find the speed adjustment. A bit frustrating. Hope you can fix, so I can also increase the rating. Thanks."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "sam", "rating": 4, "content": "one of the things i really like is how visually appealing it looks & the way you can change tones, fonts, etc. & how smoothly it runs. suggestion: i think a lot of people would appreciate if we're given more colors for highlighters (preferably colors we can personally customize) & maybe even add an underline feature for when people want to use that alongside highlighting. also, scrolling instead swiping the pages feature pls."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "lessai", "rating": 4, "content": "It's alright; could do with more fonts, though. Also, the maps used to show when I highlighted a location but they don't show anymore, Idk why. Any ideas? Idk about the reading aloud, it's a function I don't use. Could make it easier to download the books to the phone ( or SD Card)."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Jessica Vallianos", "rating": 1, "content": "Since last update I can't get more than 3 mins into a book without it stopping and closing completely. I have followed everything for trouble shooting. I have a road trip coming up and I'm tempted to download audible. This wouldn't happen with them and I need an app to work for 9 hours one way not 3mins."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "OnlyBass Fishing", "rating": 3, "content": "Everything about the app seems to work for me, it can be a pain to navigate sometimes but this review is mostly because of the Widget UI changes. What is with companies trying to fix or change things that aren't broken? The new widget is an eyesore compared to the old one, the shaded background, the loss of swiping through the books to an ugly left right virtual button.... yall messed up. Stop fixing things that aren't even broken. Whoever was the code writer was bored and should've stayed bored"},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "Patrisya Arizo", "rating": 4, "content": "This app is currently my fave app. Tho I have some concerns with the color shades from the highlights, I hope next update there will be more shades to choose from and also I'm having problems with uploading ebooks to my playbook library, it keeps on failing to upload esp when I use wifi to upload but overall experience is great just with minor issues."},
{"app_name": "Google Play Books & Audiobooks", "app_category": "Books & Reference", "app_installs": "1,899,603", "user_name": "George Sladkovsky", "rating": 1, "content": "Just stopped syncing between my iPad and android phone at some point. Sometimes it syncs, sometimes it doesn't... Bookmarks do sync reliably, but the progress is random."},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Neutral Potato", "rating": 5, "content": "Great software, amazingly accurate translation (compared to the competition). Would it be possible for the textbox to show not only paste, but clipboard function too?"},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Richard Naxton", "rating": 5, "content": "I can't speak for other language combinations but this is by far the best and most idiomatic English-German (and vice versa) translator that I have found. I've been using the desktop version for a long time and I'm very glad there's finally an Android app :)"},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "Evgeniy Minchev", "rating": 5, "content": "I just translated it through the app! In fact, I've been using the desktop version for over a year now and am very satisfied and recommend it to all my friends and colleagues! I'm so glad there's such an offer! It brings translation to a new level! Thank you guys! Keep developing this masterpiece!"},
{"app_name": "DeepL Translate", "app_category": "Books & Reference", "app_installs": "3,179", "user_name": "kennedy Onaga", "rating": 2, "content": "The developer should include floating icon in the next upgrade, just like Google translator the floating icon helps you to easily translate without going back to the app, which makes it more easier and reduce delay in communication. Other than this DEEPL translator is best app in translation"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Sundeep Dar", "rating": 1, "content": "One of the worst apps I have come across. I keep getting notifications about stories I have no interest in even though I have disabled the notifications for stories. I want to delete my account, but there's no option for that."},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Rushika Mane", "rating": 1, "content": "Hello,Pleas add some study related and inspirational content. This app becomes distraction for teenagers and all level of students. The front page of app is only filled with distracting stories. their should some moral some good thoughts but nothing can we see at 1st page of this app"},
{"app_name": "Pratilipi - World of Stories", "app_category": "Books & Reference", "app_installs": "248,811", "user_name": "Vishwanath Gogawale", "rating": 1, "content": "Words getting cut from down side of pages. Every time font settings needs to change. Please set the page & font size properly."}
]